
KalielsTrackerDB = {
	["char"] = {
		["Devops - 碧玉矿洞"] = {
			["collapsed"] = true,
			["trackedQuests"] = {
				{
					["id"] = 5464,
					["zone"] = "东瘟疫之地",
				}, -- [1]
				{
					["id"] = 977,
					["zone"] = "冬泉谷",
				}, -- [2]
				{
					["id"] = 5068,
					["zone"] = "冬泉谷",
				}, -- [3]
				{
					["id"] = 969,
					["zone"] = "冬泉谷",
				}, -- [4]
				{
					["id"] = 5063,
					["zone"] = "冬泉谷",
				}, -- [5]
				{
					["id"] = 5067,
					["zone"] = "冬泉谷",
				}, -- [6]
				{
					["id"] = 7488,
					["zone"] = "厄运之槌",
				}, -- [7]
				{
					["id"] = 7441,
					["zone"] = "厄运之槌",
				}, -- [8]
				{
					["id"] = 5518,
					["zone"] = "厄运之槌",
				}, -- [9]
				{
					["id"] = 6821,
					["zone"] = "艾萨拉",
				}, -- [10]
				{
					["id"] = 5001,
					["zone"] = "黑石塔",
				}, -- [11]
				{
					["id"] = 4867,
					["zone"] = "黑石塔",
				}, -- [12]
				{
					["id"] = 4866,
					["zone"] = "黑石塔",
				}, -- [13]
			},
		},
	},
	["global"] = {
		["helpTutorial"] = 5,
		["version"] = "0.1.2",
	},
	["profileKeys"] = {
		["Devops - 碧玉矿洞"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["xOffset"] = -31,
		},
	},
}
