
_detalhes_global = {
	["npcid_pool"] = {
		[12236] = "维利塔恩",
		[10221] = "血斧座狼幼崽",
		[4129] = "乱齿狂吠者",
		[10317] = "黑手精英",
		[6200] = "雷加斯萨特",
		[8318] = "阿塔莱奴隶",
		[10381] = "被毁坏的死尸",
		[1557] = "猩猩",
		[10413] = "地穴兽",
		[10429] = "大酋长雷德·黑手 <盖斯>",
		[1563] = "血帆流氓",
		[10461] = "瘟疫虫",
		[10477] = "通灵学院亡灵法师",
		[10509] = "杰德",
		[8510] = "阿塔莱图腾 <祖罗>",
		[8526] = "黑暗法师",
		[8542] = "死亡歌手",
		[10605] = "血色医护员",
		[8606] = "腐朽软泥怪",
		[10717] = "时光寄生虫",
		[4361] = "黑鳍泥浆鱼人",
		[4393] = "酸性沼泽软泥怪",
		[3225] = "库卡隆中士",
		[4417] = "迪菲亚工头",
		[10925] = "腐烂虫",
		[8894] = "铁怒医师",
		[8910] = "炽热火焰卫士",
		[8926] = "深渊钉刺者",
		[6520] = "灼热元素",
		[8958] = "怒爪巨熊",
		[9038] = "西斯雷尔",
		[9118] = "拉瑞安",
		[11197] = "无脑的骷髅 <瑞文戴尔男爵>",
		[9166] = "翼手龙",
		[13276] = "荒野小鬼",
		[416] = "沃尔纳姆",
		[11261] = "瑟尔林·卡斯迪诺夫教授",
		[417] = "弗拉麦恩",
		[9262] = "火印祈求者",
		[4657] = "玛洛迪逐风者",
		[4665] = "火刃老兵",
		[4689] = "饥饿的骨爪土狼",
		[3381] = "南海歹徒",
		[11501] = "戈多克大王",
		[13596] = "洛特格里普",
		[1707] = "迪菲亚俘虏",
		[3417] = "活火",
		[1711] = "迪菲亚罪犯",
		[1713] = "酱爆",
		[1715] = "迪菲亚叛军",
		[1717] = "哈姆霍克",
		[9678] = "希尔·丁格",
		[1725] = "迪菲亚哨兵",
		[1727] = "迪菲亚工人",
		[1729] = "迪菲亚招魂师",
		[1731] = "地精工匠",
		[11885] = "荒芜犬",
		[437] = "黑石叛节者",
		[4969] = "旧城区暴徒",
		[7032] = "巨型黑曜石元素",
		[7040] = "黑色龙人",
		[7048] = "炽热小龙",
		[442] = "狼蛛",
		[1783] = "骷髅剥皮者",
		[1785] = "恐惧骸骨",
		[1787] = "骷髅刽子手",
		[1789] = "骷髅侍僧",
		[1791] = "被奴役的食尸鬼",
		[1793] = "腐烂的食尸鬼",
		[1795] = "灼热的食尸鬼",
		[14396] = "伊莫塔尔之眼 <伊莫塔尔>",
		[10318] = "黑手刺客",
		[1805] = "血肉傀儡",
		[8319] = "噩梦雏龙",
		[10382] = "被撕裂的死尸",
		[10398] = "图萨丁暗影法师",
		[1815] = "生病的黑熊",
		[1817] = "生病的狼",
		[7272] = "殉教者塞卡",
		[1821] = "腐虫潜伏者",
		[10478] = "碎裂的骷髅",
		[8447] = "科朗克",
		[1827] = "血色徘徊者",
		[7320] = "石窟虐待者",
		[1833] = "血色骑士",
		[8527] = "天灾卫兵",
		[8543] = "缝合憎恶",
		[8607] = "腐烂淤泥怪",
		[7400] = "灼热图腾 V <永远的犇犇>",
		[1853] = "黑暗院长加丁",
		[7416] = "法力之泉图腾 IV <永远的犇犇>",
		[7432] = "豹",
		[7440] = "冬泉巢穴守卫",
		[7448] = "冰风奇美拉",
		[7456] = "猫头鹰",
		[5425] = "饥饿的疱爪土狼",
		[8895] = "铁怒军官",
		[8911] = "火焰驱逐者",
		[8927] = "黑暗尖啸者",
		[8959] = "魔爪狼",
		[11022] = "阿莱克斯·巴罗夫",
		[11054] = "红衣火枪手 <炮手威利>",
		[9039] = "杜姆雷尔",
		[7608] = "穆尔塔",
		[3809] = "熊",
		[1907] = "纳迦探险者",
		[478] = "河爪豺狼人前锋",
		[3825] = "未知目标",
		[9167] = "狂怒的翼手龙",
		[30] = "森林蜘蛛",
		[480] = "生锈的麦田傀儡",
		[11262] = "奥妮克希亚雏龙",
		[5649] = "沙怒饮血者",
		[485] = "黑石前锋",
		[5713] = "加什尔",
		[5721] = "德姆塞卡尔",
		[11470] = "艾德雷斯巫师",
		[13533] = "喷涌幼虫",
		[11502] = "拉格纳罗斯",
		[3909] = "治疗之泉图腾 V <天空之蓝>",
		[1961] = "癞爪",
		[11598] = "复活的守护者",
		[11614] = "血箭",
		[9583] = "血斧精兵",
		[11662] = "烈焰行者祭司",
		[5857] = "灼热熔岩蜘蛛",
		[5865] = "豹",
		[9695] = "死鞭蝎",
		[11790] = "腐烂萨特",
		[11886] = "米库提奥·污血",
		[5977] = "巨槌战士",
		[5993] = "地狱野猪",
		[4025] = "血怒伏击者",
		[6009] = "魔誓恐法师",
		[6017] = "熔岩喷射图腾 <沙怒巫医>",
		[8120] = "苏利萨斯憎恶",
		[12206] = "原始巨兽",
		[12222] = "爬行污泥怪",
		[14397] = "法力脉冲 <畸形残渣>",
		[10319] = "黑手铁卫士",
		[6193] = "恶鞭尖啸者",
		[6201] = "雷加斯潜行者",
		[10383] = "破碎的死尸 <被毁坏的死尸>",
		[10399] = "图萨丁侍僧",
		[10415] = "阿莎利水晶",
		[8384] = "神庙深渊潜伏者",
		[10447] = "多彩龙人",
		[10463] = "尖叫的女妖",
		[10495] = "生病的食尸鬼",
		[14621] = "工头玛托留斯",
		[8528] = "恐怖编织者",
		[8560] = "烂苔斥候",
		[6377] = "雷首翼鹿",
		[2170] = "黑木巨熊怪",
		[4362] = "黑鳍滩行鱼人",
		[2202] = "灰雾滩行者",
		[4418] = "迪菲亚巫师",
		[10943] = "腐朽的守护者",
		[8912] = "暮光之锤拷问者",
		[4466] = "邪枝割颅者",
		[4474] = "腐烂的死尸",
		[8960] = "魔爪食腐狼",
		[2246] = "辛迪加刺客",
		[6553] = "格里什劫掠者",
		[13118] = "红衣保镖",
		[9040] = "多普雷尔",
		[9056] = "弗诺斯·达克维尔",
		[36] = "麦田傀儡",
		[9200] = "尖石劫掠者",
		[11263] = "未知目标 <鬼灵导师>",
		[578] = "鱼人斥候",
		[4634] = "科卡尔虐待者",
		[4658] = "玛洛迪狂怒者",
		[4690] = "疯狂的骨爪土狼",
		[11439] = "詹迪斯·巴罗夫的幻象 <詹迪斯·巴罗夫>",
		[589] = "迪菲亚抢劫者",
		[11471] = "艾德雷斯鬼怪",
		[11487] = "卡雷迪斯镇长",
		[2370] = "刺脊尖啸者",
		[594] = "迪菲亚匪徒",
		[11551] = "通灵魔",
		[598] = "迪菲亚矿工",
		[9568] = "维姆萨拉克",
		[11663] = "烈焰行者医师",
		[9680] = "火浪杀手",
		[4850] = "石窟潜伏者",
		[11791] = "腐烂欺骗者",
		[9776] = "喷焰小鬼",
		[11887] = "地穴抢劫者",
		[619] = "迪菲亚咒术师",
		[622] = "地精工程师",
		[7025] = "黑石士兵",
		[7033] = "火腹食人魔",
		[7041] = "火鳞龙人",
		[10080] = "杉达尔·沙掠者",
		[7097] = "鹰头猫",
		[634] = "迪菲亚监工",
		[12207] = "塞萨拉多头怪",
		[12223] = "洞窟潜伏者",
		[12239] = "吉尔克",
		[639] = "艾德温·范克里夫",
		[641] = "地精木匠",
		[14350] = "未知目标 <海多斯博恩>",
		[2570] = "石拳萨满祭司",
		[644] = "拉克佐",
		[645] = "曲奇",
		[646] = "重拳先生",
		[647] = "绿皮队长",
		[2590] = "辛迪咒术师",
		[10400] = "图萨丁亡灵法师",
		[10416] = "喷胆者",
		[10432] = "维克图斯",
		[5226] = "黑暗虫",
		[5234] = "戈杜尼虐待者",
		[10480] = "虚弱的尸体",
		[657] = "迪菲亚海盗",
		[5258] = "木爪突击队员",
		[5274] = "铁鬃熊王",
		[2642] = "邪枝暗影法师",
		[8529] = "天灾勇士",
		[2650] = "枯木狂热者",
		[10608] = "血色神父",
		[8657] = "眩晕 <胡库>",
		[2686] = "枯木巢穴守卫",
		[674] = "风险投资公司露天矿工",
		[7441] = "冬泉图腾师",
		[10816] = "游荡的骷髅",
		[5426] = "疱爪土狼",
		[2718] = "火烟萨满祭司",
		[681] = "荆棘谷猛虎幼崽",
		[682] = "tele",
		[8897] = "厄炉工匠",
		[686] = "鞭尾迅猛龙",
		[687] = "丛林捕猎者",
		[10992] = "被激怒的黑豹",
		[8961] = "魔爪掠夺者",
		[9025] = "洛考尔",
		[9041] = "典狱官斯迪尔基斯",
		[11120] = "红衣铸锤师",
		[5618] = "废土强盗",
		[9201] = "尖石食人魔法师",
		[706] = "霜鬃巨魔幼崽",
		[5650] = "沙怒巫医",
		[9265] = "燃棘暗影猎手",
		[2850] = "忠诚卫士",
		[5714] = "洛若尔",
		[5722] = "哈扎斯",
		[11456] = "荒野暗影行者",
		[7785] = "祖穆拉恩结界 <巫医祖穆拉恩>",
		[11488] = "伊琳娜·暗木",
		[9521] = "狂怒的地狱蝙蝠",
		[9537] = "霍尔雷·黑须",
		[7857] = "南海码头工人",
		[730] = "迅猛龙",
		[731] = "君莫笑",
		[5850] = "炽热元素",
		[5858] = "巨型熔岩蜘蛛",
		[9681] = "贾兹",
		[46] = "鱼人强盗",
		[11792] = "腐烂巡影者",
		[2958] = "草原狼",
		[741] = "睡梦雏龙",
		[2966] = "未知目标",
		[743] = "龙族巡梦者",
		[745] = "刃鳞龙人队长",
		[5978] = "巨槌术士",
		[6066] = "陷地图腾 <安图苏尔>",
		[10161] = "群居雏龙",
		[12224] = "洞窟游荡者",
		[12240] = "考尔克",
		[14303] = "僵硬守护者",
		[6146] = "峭壁击碎者",
		[14399] = "奥术洪流",
		[10321] = "埃博斯塔夫",
		[3098] = "野猪",
		[3110] = "巨齿鳄鱼",
		[10417] = "泼毒者",
		[10433] = "马杜克·布莱克波尔",
		[10481] = "复生的尸体",
		[10577] = "墓穴甲虫 <地穴恶魔>",
		[8546] = "黑暗教徒",
		[8562] = "烂苔食尸者",
		[4323] = "灼热龙崽",
		[8658] = "胡库的小鬼 <胡库>",
		[10737] = "豹哥哥",
		[4363] = "黑鳍智者",
		[10801] = "喋喋不休的食尸鬼",
		[4403] = "污壳钳手龙虾人",
		[808] = "冷酷的格瑞克尼尔",
		[8898] = "铁怒队长",
		[8914] = "暮光保镖",
		[3258] = "刺背猎手",
		[4475] = "坏死的僵尸",
		[6554] = "格里什毒刺蝎",
		[9026] = "征服者派隆",
		[13136] = "亚什雄蝎 <被折磨的哨兵>",
		[824] = "迪菲亚掘地工",
		[13280] = "海多斯博恩",
		[834] = "山狗",
		[9266] = "燃棘巫医",
		[13456] = "诺克赛恩产物 <诺克赛恩>",
		[4699] = "荒土毒尾蝎",
		[11457] = "荒野唤魔者",
		[3382] = "南海炮兵",
		[11489] = "特迪斯·扭木",
		[9554] = "持铁锤的顾客",
		[4803] = "黑暗深渊智者",
		[858] = "沼泽纺丝蛛",
		[861] = "斯通纳德斥候",
		[11729] = "佐拉雌蝎",
		[4851] = "石窟嚼石者",
		[11777] = "暗影碎片巡游者",
		[866] = "斯通纳德步兵",
		[11873] = "鬼魅随从",
		[11937] = "恶魔之门的卫士",
		[9938] = "玛格姆斯",
		[7026] = "黑石巫师",
		[7034] = "火腹食人魔法师",
		[7042] = "黑色龙族",
		[12129] = "奥妮克希亚守卫",
		[7098] = "猫头鹰",
		[10162] = "维克多·奈法里奥斯",
		[12225] = "被诅咒的塞雷布拉斯",
		[12241] = "玛格拉",
		[12257] = "机械雪人",
		[12337] = "红衣信使",
		[14400] = "奥术回馈者",
		[7226] = "未知目标 <古代的石头看守者>",
		[10418] = "红衣卫兵",
		[7274] = "沙怒刽子手",
		[8419] = "暮光崇拜者",
		[5243] = "被诅咒的阿塔莱巨魔",
		[10498] = "鬼灵导师",
		[5259] = "阿塔莱巫医",
		[5267] = "阿塔莱行尸",
		[5283] = "噩梦游荡者",
		[5291] = "哈卡莱霜翼飞蛇",
		[5307] = "冰至",
		[7402] = "灼热图腾 VI",
		[5363] = "北泉游荡者",
		[10738] = "冬泉酋长",
		[7442] = "冬泉探路者",
		[10802] = "守护者希坦亚",
		[7458] = "冰蓟雪人",
		[7466] = "熔岩图腾 IV <炒股遇牛市>",
		[10946] = "掠夺者霍古斯",
		[8915] = "暮光之锤特使",
		[946] = "霜鬃巨魔新兵",
		[11058] = "弗拉斯·希亚比",
		[9027] = "修行者高罗什",
		[9043] = "裂盾步兵",
		[3810] = "范冰冰",
		[9267] = "燃棘掷斧者",
		[3862] = "二狗",
		[5715] = "胡库",
		[11442] = "戈多克虐待者",
		[11458] = "僵化的树人",
		[7786] = "祖穆拉恩骷髅",
		[13601] = "工匠吉兹洛克",
		[7858] = "南海流氓",
		[11666] = "火焰行者",
		[5843] = "奴隶工",
		[11746] = "沙漠奔行者",
		[11778] = "暗影碎片击碎者",
		[12018] = "管理者埃克索图斯",
		[12098] = "萨弗隆先驱者",
		[10083] = "狂爪火鳞龙人",
		[12178] = "被折磨的德鲁伊",
		[1020] = "杂斑迅猛龙",
		[1021] = "杂斑尖啸龙",
		[12242] = "玛拉多斯",
		[6131] = "龙人施法者",
		[14321] = "卫兵芬古斯",
		[6147] = "峭壁咆哮者",
		[14385] = "末日守卫",
		[10339] = "盖斯",
		[12418] = "戈多克土狼",
		[10387] = "复仇的幻影",
		[10419] = "红衣魔术师",
		[14529] = "疯狂的克林弗兰",
		[10499] = "鬼灵研究员",
		[8532] = "生病的剥皮者",
		[8548] = "邪恶导师",
		[8580] = "阿塔拉利恩",
		[8596] = "瘟疫幼犬",
		[10659] = "深蓝雏龙",
		[4324] = "灼热雏龙",
		[1084] = "小盐齿鳄鱼",
		[4404] = "污壳狂钳龙虾人",
		[10947] = "未知目标",
		[8916] = "竞技场观众",
		[8932] = "钻孔甲虫",
		[1120] = "霜鬃巨魔",
		[1122] = "霜鬃剥皮者",
		[2247] = "辛迪加执行者",
		[11043] = "红衣僧侣",
		[6555] = "格里什掘洞蝎",
		[11075] = "护锅者拜尔摩",
		[9044] = "裂盾哨兵",
		[1134] = "雪怪幼崽",
		[1138] = "雪狼",
		[9156] = "弗莱拉斯大使",
		[13282] = "诺克赛恩",
		[1152] = "钳嘴鳄鱼",
		[9236] = "暗影猎手沃什加斯",
		[1158] = "被诅咒的水兵",
		[9268] = "燃棘狂战士",
		[1162] = "碎石怪斥候",
		[1164] = "碎石怪断骨者",
		[1166] = "碎石怪先知",
		[1172] = "坑道鼠歹徒",
		[4692] = "恐怖飞扑者",
		[11443] = "戈多克食人魔法师",
		[11459] = "埃隆巴克保护者",
		[11475] = "艾德雷斯幻像",
		[1184] = "峭壁潜伏者",
		[9476] = "卫兵杜格瑞普",
		[1188] = "灰斑黑熊",
		[1196] = "冰爪熊",
		[1202] = "坑道鼠狗头人",
		[11667] = "烈焰守卫",
		[1206] = "纳什尔",
		[2423] = "奥里登·匹瑞诺德领主",
		[4852] = "石窟智者",
		[9716] = "血斧好战者",
		[7011] = "土灵碎岩者",
		[9956] = "暗炉持火者",
		[7035] = "火腹蛮兵",
		[7043] = "火鳞龙族",
		[12099] = "火誓者",
		[7091] = "暗炉伏击者",
		[7099] = "猫头鹰",
		[12179] = "被折磨的哨兵",
		[1270] = "恶臭的食尸鬼",
		[7139] = "铁木践踏者",
		[12243] = "温格",
		[12259] = "基赫纳斯",
		[2559] = "高地阔步龙",
		[2563] = "平原狼蛛",
		[2571] = "石拳领主",
		[12339] = "德米提雅",
		[2579] = "山地秃鹰",
		[2591] = "辛迪加占星师",
		[10372] = "狂爪火舌龙人",
		[10388] = "怀恨的幻影 <Anne>",
		[10420] = "红衣新兵",
		[7267] = "乌克兹·沙顶",
		[7275] = "暗影祭司塞瑟斯",
		[8437] = "哈卡莱爪牙",
		[10500] = "鬼灵教师",
		[10516] = "不可宽恕者",
		[5268] = "铁鬃熊",
		[2643] = "邪枝狂战士",
		[10580] = "恶臭僵尸",
		[10596] = "烟网蛛后",
		[2655] = "绿色淤泥怪",
		[8597] = "瘟疫犬",
		[10660] = "深蓝龙崽",
		[7435] = "深蓝龙族",
		[7443] = "碎齿暴熊",
		[7451] = "狂怒的枭兽",
		[7459] = "冰蓟雪人女王",
		[10836] = "农夫达尔松",
		[5428] = "大鹏",
		[2719] = "火烟领主",
		[2727] = "峭壁山狗",
		[10916] = "冬泉信使",
		[2739] = "暗炉隧道工",
		[10980] = "乌米的机械雪人",
		[10996] = "英雄之魂",
		[8981] = "失控的掠夺者",
		[9029] = "剜眼者",
		[9045] = "裂盾侍僧",
		[2783] = "玛雷兹·考尔",
		[1400] = "湿地鳄鱼",
		[9237] = "指挥官沃恩",
		[2831] = "巨型秃鹫",
		[1418] = "蓝腮袭击者",
		[89] = "地狱火爪牙",
		[5708] = "哈卡的后代",
		[5716] = "祖罗尔",
		[11444] = "戈多克大法师",
		[7787] = "沙怒奴隶",
		[7795] = "水占师维蕾萨",
		[9461] = "狂乱的黑色幼龙",
		[9477] = "克隆软泥怪",
		[9541] = "黑须的亲信",
		[5828] = "黑子",
		[11668] = "火焰之王",
		[9637] = "灼烧图腾 <控火师罗格雷恩>",
		[2927] = "邪恶的枭兽",
		[5860] = "暮光黑暗萨满祭司",
		[9701] = "黑石塔蝎子",
		[9717] = "血斧召唤师",
		[7995] = "邪恶祭司海克斯",
		[11988] = "焚化者古雷曼格",
		[94] = "迪菲亚小偷",
		[6020] = "滑壳龙虾人",
		[12100] = "熔岩掠夺者",
		[8115] = "巫医尤克里",
		[8147] = "莫沙彻营地卫兵",
		[8179] = "强效治疗结界 <沙怒巫医>",
		[14323] = "卫兵斯里基克",
		[6148] = "峭壁行者",
		[10261] = "燃烧地狱犬 <裂盾术士>",
		[6196] = "恶鞭侍从",
		[10389] = "狂怒的幻影 <Anne>",
		[10405] = "恶疫食尸鬼",
		[10421] = "红衣防御者",
		[10437] = "奈鲁布恩坎",
		[10469] = "通灵学院专家",
		[10485] = "复活的畸形骷髅",
		[8534] = "腐烂的石像鬼",
		[8550] = "暗影法师",
		[8566] = "黑铁哨兵",
		[8598] = "狂怒的瘟疫犬",
		[10661] = "噬魔龙崽",
		[6380] = "雷首角鹰雌兽",
		[6412] = "骷髅 <护锅者玛维诺斯>",
		[10901] = "博学者普克尔特",
		[8902] = "暗炉平民",
		[4469] = "碧绿软泥怪",
		[10997] = "炮手威利",
		[4493] = "血色复仇者",
		[6556] = "胶质软泥怪",
		[11077] = "护锅者玛维诺斯",
		[9046] = "裂盾军需官",
		[1666] = "卡姆·深怒",
		[4637] = "科卡尔摧毁者",
		[9318] = "熏火龙",
		[4693] = "恐怖飞鸟",
		[11445] = "戈多克领主",
		[11461] = "扭木守护者",
		[11477] = "腐烂的上层精灵",
		[1696] = "可怕的塔格尔",
		[1706] = "未知目标",
		[1708] = "迪菲亚狱友",
		[1716] = "巴基尔·斯瑞德",
		[1718] = "石腭袭击者",
		[1720] = "布鲁高·铁拳",
		[4845] = "暗炉恶棍",
		[1726] = "迪菲亚法师",
		[4861] = "利齿蝙蝠",
		[11781] = "琥珀碎片摧毁者",
		[1732] = "迪菲亚塑风师",
		[3475] = "猪一样的层层",
		[9878] = "热能野兽",
		[7012] = "土灵雕刻者",
		[1756] = "奥妮克希亚的精英护卫",
		[7028] = "黑石术士",
		[7036] = "索瑞森间谍",
		[7044] = "黑色幼龙",
		[7076] = "土灵守护者",
		[7092] = "被污染的软泥怪",
		[7100] = "曲木食苔者",
		[1784] = "骷髅巫师",
		[1788] = "骷髅军官",
		[7156] = "死木守卫",
		[14324] = "观察者克鲁什",
		[1794] = "没有灵魂的食尸鬼",
		[1796] = "冰冷的食尸鬼",
		[14372] = "冬泉伏击者",
		[14388] = "游荡的黑龙",
		[1802] = "饥饿的鬼魂",
		[1804] = "哀嚎的死者",
		[7228] = "艾隆纳亚",
		[3619] = "粉条",
		[10390] = "骷髅守护者",
		[10406] = "食尸抢夺者",
		[1816] = "生病的灰熊",
		[8391] = "黑衣拉索里克",
		[7276] = "祖尔法拉克阵亡英雄",
		[114] = "看守傀儡",
		[1824] = "瘟疫潜伏者",
		[1826] = "血色法师",
		[5261] = "被奴役的阿塔莱巨魔",
		[5269] = "阿塔莱祭司",
		[5277] = "噩梦刃鳞龙人",
		[8519] = "荒芜巨浪",
		[8535] = "腐烂的尖啸者",
		[8551] = "黑暗召唤师",
		[1840] = "大检察官伊森利恩",
		[1846] = "保卫者洛瑞克",
		[10678] = "瘟疫龙崽",
		[7396] = "土灵破石者",
		[5357] = "大地行者",
		[116] = "迪菲亚强盗",
		[10742] = "黑手驭龙者",
		[7436] = "深蓝刃鳞龙人",
		[7444] = "碎齿熊",
		[7452] = "疯狂的枭兽",
		[7460] = "冰蓟雪人王",
		[5429] = "火鹏",
		[5461] = "海元素",
		[8903] = "铁怒上尉",
		[1884] = "血色伐木工",
		[8983] = "傀儡统帅阿格曼奇",
		[9031] = "阿努希尔",
		[13141] = "深腐践踏者",
		[7604] = "布莱中士",
		[11142] = "亡灵邮差",
		[3823] = "狼",
		[5645] = "沙怒剥皮者",
		[121] = "迪菲亚巡路者",
		[5709] = "伊兰尼库斯的阴影",
		[5717] = "米杉",
		[7788] = "沙怒苦工",
		[122] = "迪菲亚路霸",
		[3903] = "灼热图腾 III",
		[7844] = "火焰新星图腾 IV <安图苏尔>",
		[11622] = "血骨傀儡",
		[3947] = "地精造船师",
		[5853] = "温和的作战傀儡",
		[5861] = "暮光火焰卫士",
		[11782] = "琥珀碎片毁灭者",
		[11878] = "纳萨诺斯·凋零者",
		[5981] = "未知目标",
		[4023] = "血怒游荡者",
		[6005] = "魔誓暴徒",
		[12118] = "鲁西弗隆",
		[4067] = "夜行虎",
		[8156] = "安图苏尔的仆从 <安图苏尔>",
		[6117] = "上层精灵鬼巫",
		[12262] = "通灵塔保护者",
		[4095] = "加拉克虐待者",
		[10375] = "尖塔小蜘蛛",
		[10391] = "骷髅狂战士",
		[10407] = "鲜肉食尸鬼",
		[10423] = "红衣牧师",
		[10439] = "吞咽者拉姆斯登",
		[8408] = "军阀克雷利安",
		[10471] = "通灵学院侍僧",
		[10487] = "复活的保卫者",
		[10503] = "詹迪斯·巴罗夫",
		[8504] = "黑铁斥候",
		[8520] = "瘟疫破坏者",
		[6349] = "大型碎浪多头怪",
		[4334] = "火鬃招炎者",
		[10951] = "肆虐的尸体",
		[8920] = "武器技师",
		[6517] = "焦油兽",
		[2244] = "辛迪加暗影法师",
		[4494] = "血色缚法者",
		[6557] = "原生软泥怪",
		[2260] = "辛迪加潜行者",
		[13142] = "深腐纠缠者",
		[9096] = "狂爪龙人",
		[9176] = "戈泰什",
		[9240] = "燃棘暗影牧师",
		[2320] = "纳伽兹",
		[4654] = "玛洛迪斥候",
		[2356] = "老灰熊",
		[2368] = "刺脊捕猎者",
		[2384] = "饥饿的山地狮",
		[13718] = "无名预言者",
		[11687] = "鬼魅袭击者",
		[4846] = "暗炉掘地工",
		[4854] = "格瑞姆洛克",
		[11783] = "瑟莱德丝碎片",
		[9816] = "烈焰卫士艾博希尔",
		[7037] = "索瑞森驭火者",
		[10040] = "格里什虫巢卫士",
		[7077] = "土灵筑厅师",
		[2520] = "遥控傀儡 <地精工程师>",
		[7101] = "曲木撕裂者",
		[10120] = "宝库护卫者",
		[10184] = "奥妮克希亚",
		[12263] = "屠宰房保护者",
		[14326] = "卫兵摩尔达",
		[2580] = "老山地秃鹰",
		[2588] = "辛迪加潜伏者",
		[2592] = "顽石流放者",
		[2596] = "刺脊巫师",
		[10408] = "石翼石像鬼",
		[10424] = "红衣豪侠",
		[10440] = "瑞文戴尔男爵",
		[10472] = "通灵学院神秘学者",
		[10488] = "复活的构造体",
		[5254] = "木爪秘法师",
		[5262] = "格罗多克大猩猩",
		[5270] = "阿塔莱食尸者",
		[2640] = "邪枝巫医",
		[5286] = "长牙奔跑者",
		[2648] = "邪枝精英卫兵",
		[2652] = "枯木毒血巨魔",
		[2656] = "玉石软泥怪",
		[8601] = "毒性瘟疫蝙蝠",
		[10680] = "被召唤的黑手恐法师 <黑手召唤师>",
		[7397] = "土灵凿石者",
		[2680] = "邪枝狼崽",
		[7437] = "深蓝龙人法师",
		[7445] = "熊",
		[10808] = "悲惨的提米",
		[5422] = "沙漠猎食蝎",
		[2716] = "火烟猎龙者",
		[2720] = "火烟食人魔法师",
		[5462] = "巨型海元素",
		[2736] = "巨型石元素",
		[10952] = "肆虐的骷髅",
		[8921] = "血犬",
		[2748] = "阿扎达斯",
		[11032] = "狂热的玛洛尔",
		[9017] = "伊森迪奥斯",
		[9033] = "安格弗将军",
		[7605] = "拉文",
		[9097] = "裂盾军团战士",
		[10584] = "乌洛克",
		[440] = "黑石步兵",
		[9269] = "燃棘先知",
		[11741] = "掘泥摧毁者",
		[5646] = "沙怒掷斧者",
		[9257] = "裂盾术士",
		[11727] = "佐拉巨蜂",
		[1834] = "血色圣骑士",
		[7725] = "恐怖图腾袭击者",
		[8996] = "虚空行者",
		[11735] = "石鞭蝎",
		[10371] = "狂爪队长",
		[5710] = "预言者迦玛兰",
		[5273] = "阿塔莱高阶祭司",
		[11448] = "戈多克术士",
		[2923] = "癞皮银鬃狼",
		[11480] = "奥术畸兽",
		[7797] = "卢兹鲁",
		[5249] = "混血木爪豺狼人",
		[12119] = "烈焰行者护卫",
		[1562] = "血帆法师",
		[1836] = "血色骑兵",
		[8900] = "厄炉魔匠",
		[7845] = "火焰新星图腾 V <炒股遇牛市>",
		[8324] = "阿塔莱骷髅 <祖罗>",
		[7268] = "沙怒守护者",
		[5846] = "黑铁工头",
		[5854] = "重型作战傀儡",
		[11672] = "熔火怒犬",
		[2924] = "银鬃狼",
		[2928] = "远古枭兽",
		[5862] = "暮光地占师",
		[11736] = "石鞭巨钳蝎",
		[5225] = "黑暗粘液虫",
		[14356] = "锯鳍狂鱼",
		[11784] = "瑟莱德丝卫士",
		[624] = "亡灵挖掘者",
		[13022] = "抽笞者",
		[14308] = "费拉",
		[5361] = "被缩小的波涛巨人",
		[9817] = "黑手恐法师",
		[11880] = "暮光复仇者",
		[11896] = "淤血虫",
		[11476] = "上层精灵骷髅",
		[14398] = "艾德雷斯精龙",
		[9684] = "拉克维",
		[8899] = "厄炉龙骑兵",
		[5990] = "红石蜥蜴",
		[6004] = "魔誓祭司",
		[6006] = "魔誓专家",
		[11740] = "掘泥打击者",
		[11724] = "亚什蜂群",
		[12056] = "迦顿男爵",
		[2929] = "野蛮的枭兽",
		[10041] = "格里什皇后",
		[5852] = "地狱元素",
		[7027] = "黑石杀戮者",
		[12261] = "被感染的烂苔巨魔",
		[11496] = "伊莫塔尔",
		[1124] = "霜鬃暗法师",
		[5844] = "黑铁奴隶贩子",
		[11728] = "佐拉掠夺者",
		[12216] = "毒劣魔",
		[625] = "亡灵爆破者",
		[12248] = "未知目标",
		[12264] = "沙斯拉尔",
		[5617] = "废土暗法师",
		[14343] = "无敌小狗蛋",
		[1832] = "血色占星师",
		[193] = "蓝色龙人",
		[2647] = "邪枝噬魂者",
		[11664] = "烈焰行者精英",
		[6190] = "恶鞭战士",
		[3100] = "皮皮猪",
		[6521] = "有生烈焰",
		[8933] = "洞穴爬行者",
		[7524] = "痛苦的上层精灵",
		[10409] = "石翼尖啸者",
		[10425] = "红衣战斗法师",
		[10441] = "瘟疫鼠",
		[9376] = "火焰使者",
		[3260] = "刺背寻水者",
		[8442] = "未知目标",
		[10505] = "讲师玛丽希亚",
		[11078] = "护锅者索瓦斯",
		[11486] = "托塞德林王子",
		[2248] = "洞穴雪人",
		[8522] = "瘟疫水元素",
		[8538] = "未知目标",
		[10601] = "乌洛克惩戒者",
		[2644] = "邪枝剥皮者",
		[9736] = "军需官兹格雷斯",
		[8602] = "巨型瘟疫蝙蝠",
		[3415] = "未知目标",
		[10681] = "被召唤的黑手老兵 <黑手召唤师>",
		[10697] = "绿汁软泥怪",
		[2560] = "高地长尾龙",
		[4343] = "尘泥钳嘴鳄鱼",
		[8901] = "铁怒预备兵",
		[13696] = "诺克赛恩幼体",
		[14325] = "克罗卡斯",
		[5292] = "深痕雪人",
		[8762] = "林木隐匿者",
		[9197] = "尖石战斗法师",
		[11671] = "熔火恶犬",
		[10081] = "灰尘怨灵",
		[4465] = "邪枝标枪手",
		[8906] = "狂怒傀儡",
		[3240] = "雷角蜥蜴",
		[9198] = "尖石秘法师",
		[8890] = "铁怒狱卒",
		[10953] = "霍古斯的仆从",
		[8922] = "巨型血犬",
		[6518] = "焦油潜伏者",
		[767] = "莫闹",
		[9697] = "巨型灰烬座狼",
		[9018] = "审讯官格斯塔恩",
		[7450] = "蓬毛枭兽",
		[4511] = "筱跟班儿",
		[9034] = "黑特雷尔",
		[9777] = "灵焰小鬼",
		[13160] = "腐蚀群居虫",
		[2646] = "邪枝饮血者",
		[9098] = "裂盾缚法师",
		[9545] = "恐怖的奴隶主",
		[1883] = "血色工人",
		[2630] = "地缚图腾 <冬泉图腾师>",
		[9162] = "幼双帆龙",
		[10536] = "瘟疫蛆",
		[1822] = "毒雾潜伏者",
		[11257] = "通灵学院管理者",
		[10504] = "阿雷克斯·巴罗夫",
		[8907] = "怒锤傀儡",
		[9258] = "裂盾袭击者",
		[10940] = "往日的幽灵",
		[643] = "斯尼德 <斯尼德的伐木机>",
		[4655] = "玛洛迪争斗者",
		[4663] = "火刃预言师",
		[7126] = "加德纳尔猎犬",
		[769] = "死亡狼蛛",
		[2721] = "被遗忘者保镖",
		[13197] = "魔鞭抽笞者",
		[12265] = "熔岩爪牙 <火焰之王>",
		[11465] = "扭木践踏者",
		[10438] = "苍白的玛勒基",
		[4727] = "老迈的雷霆蜥蜴",
		[10812] = "大十字军战士达索汉",
		[7132] = "剧毒之水",
		[10218] = "超强治疗结界 <燃棘巫医>",
		[590] = "迪菲亚强夺者",
		[8913] = "暮光使者",
		[3767] = "冷心欺诈者",
		[5360] = "深海巨人",
		[4847] = "暗炉发掘者",
		[3424] = "风蛇",
		[8889] = "铁怒监军",
		[11673] = "上古熔火恶犬",
		[8525] = "天灾看守",
		[642] = "斯尼德的伐木机",
		[10464] = "哀嚎的女妖",
		[9690] = "灰烬座狼",
		[4855] = "石窟争斗者",
		[4863] = "玉脊蜥蜴",
		[11785] = "黄眼蜥蜴",
		[2406] = "山地狮",
		[2653] = "枯木虐待者",
		[3472] = "拾光",
		[3476] = "依沙瓦克",
		[9818] = "黑手召唤师",
		[11881] = "暮光地王",
		[11897] = "暗翼蝠",
		[2649] = "枯木割颅者",
		[5288] = "疯狂的长牙狼",
		[5280] = "噩梦龙族",
		[5308] = "游荡的山谷尖啸者",
		[3581] = "下水道鳄鱼",
		[7022] = "毒鞭蝎",
		[7030] = "暗炉地质学家",
		[7038] = "索瑞森密探",
		[10508] = "莱斯·霜语",
		[12057] = "加尔",
		[6910] = "鲁维罗什",
		[1176] = "坑道鼠征粮官",
		[7078] = "裂隙沙漠蝎",
		[4860] = "石头管理者",
		[7271] = "巫医祖穆拉恩",
		[4853] = "石窟地占师",
		[6195] = "恶鞭海妖",
		[3560] = "治疗结界 <石窟智者>",
		[12201] = "瑟莱德丝公主",
		[12217] = "腐化劣魔",
		[38] = "迪菲亚暴徒",
		[11686] = "鬼魅掠夺者",
		[7158] = "死木萨满祭司",
		[8438] = "哈卡莱护血者",
		[8257] = "小软泥怪",
		[7246] = "沙怒暗影猎手",
		[8905] = "战斗傀儡",
		[7856] = "南海劫掠者",
		[7206] = "古代的石头看守者",
		[8283] = "奴隶主托恩·黑心",
		[7457] = "游荡的冰蓟雪人",
		[10268] = "奴役者基兹鲁尔",
		[2565] = "巨型平原狼蛛",
		[10394] = "黑衣守卫斥候",
		[8904] = "暗炉议员",
		[10426] = "红衣审查者",
		[10442] = "多彩雏龙",
		[9416] = "裂盾座狼",
		[7286] = "祖尔法拉克僵尸",
		[10602] = "乌洛克法师",
		[10506] = "传令官基尔图诺斯",
		[5263] = "阿塔莱木乃伊",
		[5271] = "阿塔莱死亡行者",
		[10177] = "黑石塔甲虫",
		[8523] = "天灾士兵",
		[8539] = "无眼观察者",
		[8555] = "地穴恶魔",
		[12208] = "屈服的纳萨诺斯之魂",
		[12203] = "兰斯利德",
		[8656] = "未知目标 <胡库>",
		[9016] = "贝尔加",
		[1831] = "血色猎人",
		[10698] = "被召唤的僵尸 <黑暗召唤师>",
		[5359] = "被缩小的海岸巨人",
		[2926] = "银鬃捕猎者",
		[732] = "鱼人潜伏者",
		[9032] = "爬行者赫杜姆",
		[7438] = "冬泉巨熊怪",
		[1150] = "淡水鳄",
		[7454] = "狂暴枭兽",
		[3123] = "血爪锐齿龙",
		[5423] = "沙漠鞭尾蝎",
		[1128] = "黑熊幼崽",
		[11030] = "无脑的亡灵",
		[13036] = "戈多克驯狼",
		[4468] = "玉石淤泥怪",
		[1116] = "石腭伏击者",
		[10938] = "未知目标",
		[10954] = "放血者",
		[12636] = "乔吉亚",
		[11613] = "猎人莱德雷",
		[5295] = "暴怒的深痕雪人",
		[7321] = "石窟织炎者",
		[11082] = "斯坦索姆信使",
		[11669] = "烈焰小鬼",
		[9019] = "达格兰·索瑞森大帝",
		[9035] = "安格雷尔",
		[9696] = "血斧座狼",
		[7606] = "欧罗·血眼",
		[6350] = "玛科尼锐爪龙虾人",
		[2651] = "枯木剥皮者",
		[11661] = "烈焰行者",
		[3820] = "野棘毒蜘蛛",
		[11290] = "烂苔僵尸",
		[9163] = "双帆龙",
		[5615] = "废土游荡者",
		[5623] = "废土刺客",
		[11258] = "脆弱的骷髅",
		[11685] = "玛洛迪祭司",
		[5647] = "沙怒猎头者",
		[9259] = "火印步兵",
		[10414] = "缝补憎恶",
		[1763] = "基尔尼格",
		[7726] = "恐怖图腾博学者",
		[7734] = "伊利法尔",
		[10502] = "伊露希亚·巴罗夫",
		[9692] = "血斧袭击者",
		[5711] = "可悲的奥戈姆",
		[5719] = "摩弗拉斯",
		[11450] = "戈多克掠夺者",
		[11466] = "上层精灵召唤者",
		[1211] = "麻疯侏儒",
		[5255] = "木爪劫掠者",
		[3904] = "灼热图腾 IV",
		[9447] = "血色典狱官",
		[9499] = "普拉格",
		[5235] = "真菌软泥怪",
		[11659] = "熔核摧毁者",
		[9547] = "醉酒的奴隶主",
		[5807] = "锤子",
		[11469] = "艾德雷斯怨魂",
		[10430] = "比斯巨兽",
		[11658] = "熔核巨人",
		[5839] = "黑铁地质学家",
		[11611] = "骑士杜尔根",
		[5855] = "熔岩元素",
		[11722] = "亚什防御者",
		[9691] = "毒尖蝎",
		[525] = "癞皮狼",
		[8336] = "哈卡莱挖掘者",
		[11786] = "黄眼掠夺者",
		[10470] = "通灵学院新学徒",
		[10366] = "狂爪龙人卫士",
		[8440] = "哈卡的化身",
		[6198] = "血精灵勘测员",
		[9819] = "黑手老兵",
		[6194] = "恶鞭毒蛇守卫",
		[11483] = "法力残渣",
		[2351] = "灰熊",
		[4124] = "牙好着呢",
		[1175] = "坑道鼠掘地工",
		[7453] = "月光枭兽",
		[5991] = "红石晶鳞蜥蜴",
		[2421] = "玛克拉克",
		[9319] = "驯犬者格雷布玛尔",
		[4032] = "奇美拉幼崽",
		[12101] = "熔岩奔腾者",
		[8497] = "噩梦镇压者",
		[8531] = "喋喋不休的食尸鬼",
		[16184] = "蛛怪监工",
		[6130] = "蓝色刃鳞龙人",
		[9199] = "尖石执行者",
		[11291] = "不死的烂苔巨魔",
		[11076] = "护锅者拉扎奇",
		[7273] = "加兹瑞拉",
		[1151] = "海鳄",
		[7523] = "受难的上层精灵",
		[12218] = "邪恶幼虫",
		[8558] = "地穴屠戮者",
		[12250] = "流亡者塞达尔",
		[7670] = "奥利斯塔的仆从",
		[1025] = "蓝腮污水鱼人",
		[10422] = "红衣法术师",
		[5228] = "深色软泥怪",
		[7157] = "死木复仇者",
		[9030] = "破坏者奥科索尔",
		[11665] = "熔岩歼灭者",
		[1039] = "沼泽定居者",
		[6199] = "血精灵搜寻者",
		[10363] = "达基萨斯将军",
		[2261] = "辛迪加卫士",
		[2089] = "巨型湿地鳄鱼",
		[10411] = "纳克萨玛斯之眼",
		[4512] = "野猪",
		[1051] = "黑铁矮人",
		[14322] = "践踏者克雷格",
		[10475] = "通灵学院学员",
		[10491] = "复活的骷髅守卫",
		[10507] = "拉文尼亚",
		[1845] = "保卫者塔尔森",
		[4248] = "杂毛土狼",
		[14386] = "游荡的基尔罗格之眼",
		[8524] = "诅咒法师",
		[8540] = "破碎尖啸者",
		[8556] = "地穴巡逻者",
		[6527] = "焦油爬行者",
		[4472] = "亡鬼幻象",
		[6351] = "风暴海湾智者",
		[2354] = "邪恶的灰熊",
		[10955] = "未知目标 <红衣魔术师>",
		[10699] = "腐食甲虫 <地穴恐魔>",
		[1085] = "霸天虎",
		[6519] = "焦油兽王",
		[4328] = "火鬃守卫",
		[4360] = "黑鳍战士",
		[2185] = "黑海岸蛇颈龙",
		[8444] = "贸易首领考维克",
		[10811] = "档案管理员加尔福特",
		[10827] = "亡语者塞伦德",
		[8956] = "怒爪熊",
		[11440] = "戈多克执行者",
		[4416] = "迪菲亚赤膊矿工",
		[1115] = "石腭击颅者",
		[1109] = "碎尸鸟",
		[8876] = "沙怒侍僧",
		[8892] = "铁怒步兵",
		[8908] = "熔岩作战傀儡",
		[1117] = "石腭断骨者",
		[1119] = "雪盲石腭怪",
		[1121] = "霜鬃雪行者",
		[1123] = "霜鬃猎头者",
		[9239] = "燃棘秘法师",
		[6551] = "格里什异种蝎",
		[6559] = "粘稠的软泥怪",
		[1131] = "冬狼",
		[9036] = "瓦勒雷尔",
		[1135] = "雪怪",
		[1024] = "蓝腮鱼人",
		[285] = "鱼人",
		[0] = "被占据",
		[14370] = "尸虫",
		[10374] = "尖塔蜘蛛",
		[9164] = "老双帆龙",
		[4635] = "科卡尔逐风者",
		[9196] = "欧莫克大王",
		[9398] = "暮光之锤刽子手",
		[8530] = "吃人的食尸鬼",
		[1157] = "被诅咒的水手",
		[7405] = "致命的裂隙沙漠蝎",
		[1161] = "碎石穴居人",
		[1163] = "碎石怪击颅者",
		[4656] = "玛洛迪虐待者",
		[4664] = "火刃劫掠者",
		[2407] = "巨型山地狮",
		[4680] = "末日看守队长",
		[1173] = "坑道鼠斥候",
		[2349] = "巨型食苔蛛",
		[1177] = "坑道鼠勘探员",
		[4020] = "腐蚀兽",
		[9436] = "贝尔加的产物 <贝尔加>",
		[4728] = "砂腭蜥蜴",
		[2369] = "刺脊滩行者",
		[11738] = "掠沙蜘蛛",
		[2377] = "碎鳍潮行鱼人",
		[3099] = "野猪",
		[2385] = "未知目标",
		[1195] = "森林潜伏者",
		[1197] = "碎石怪萨满祭司",
		[1199] = "雪豹幼崽",
		[1201] = "雪豹",
		[2405] = "塔伦米尔亡灵卫兵",
		[1205] = "格劳姆格",
		[1207] = "布劳勒尔",
		[10486] = "复活的战士",
		[11723] = "亚什沙行者",
		[4848] = "暗炉暗法师",
		[9708] = "燃烧小鬼 <裂盾术士>",
		[3450] = "迪菲亚鹦鹉",
		[11787] = "岩孔虫",
		[8400] = "奥比斯顿",
		[8600] = "瘟疫蝙蝠",
		[11725] = "佐拉守卫",
		[7846] = "吞噬者特雷姆斯",
		[11789] = "深岩虫",
		[10806] = "米莎",
		[10814] = "多彩精英卫士",
		[5419] = "晶鳞蜥蜴",
		[7309] = "土灵管理者",
		[1174] = "坑道鼠地卜师",
		[1114] = "丛林大猩猩",
		[8896] = "暗炉农夫",
		[7023] = "黑曜石哨兵",
		[7031] = "黑曜石元素",
		[7039] = "战争掠夺者",
		[7047] = "黑色小龙",
		[7055] = "黑石座狼",
		[14122] = "巨型喷泉 <海多斯博恩>",
		[9024] = "控火师罗格雷恩",
		[1259] = "高布勒尔",
		[7796] = "耐克鲁姆",
		[1663] = "迪克斯特·瓦德",
		[9698] = "火尾蝎",
		[6378] = "雷首天鸣者",
		[10183] = "月焰图腾 <冬泉图腾师>",
		[1271] = "冰须",
		[12219] = "尖刺鞭笞者",
		[12128] = "红衣精英",
		[8929] = "铁炉堡公主茉艾拉·铜须",
		[10220] = "哈雷肯",
		[2561] = "高地猎兽龙",
		[7175] = "石窟伏击者",
		[2569] = "石拳虐待者",
		[8928] = "洞穴雷霆蜥蜴",
		[7789] = "沙怒智障者",
		[10316] = "黑手监禁者",
		[8561] = "烂苔暗影猎手",
		[449] = "迪菲亚拳匪",
		[8317] = "阿塔莱死亡行者的灵魂 <阿塔莱死亡行者>",
		[2597] = "法库雷斯特公爵",
		[7247] = "沙怒噬魂者",
		[10412] = "地穴爬行者",
		[11793] = "塞雷布拉斯树妖",
		[5224] = "黑暗滑行虫",
		[5232] = "戈杜尼蛮兵",
		[10476] = "通灵学院通灵师",
		[5287] = "长牙嚎叫者",
		[5256] = "阿塔莱战士",
		[8477] = "骷髅仆从",
		[441] = "黑龙雏龙",
		[2641] = "邪枝猎头者",
		[2645] = "邪枝暗影猎手",
		[8541] = "憎恨吟唱者",
		[8557] = "地穴恐魔",
		[9216] = "尖石军阀",
		[1860] = "扎格萨特",
		[5328] = "海滩龙虾人先知",
		[2350] = "森林食苔蛛",
		[8637] = "黑铁巡逻兵",
		[11982] = "玛格曼达",
		[2681] = "邪枝巨狼",
		[7415] = "法力之泉图腾 III <六维兽>",
		[1835] = "血色祈求者",
		[7431] = "豹",
		[7439] = "冬泉萨满祭司",
		[7447] = "冰风奇美拉幼兽",
		[7455] = "猫头鹰 <海力布小号>",
		[2522] = "抹了油的泼猴",
		[5424] = "蝎子",
		[2717] = "火烟虐待者",
		[10876] = "亡灵甲虫 <奈鲁布恩坎>",
		[636] = "迪菲亚黑衣卫兵",
		[2729] = "老峭壁山狗",
		[8877] = "沙怒狂热者",
		[8893] = "铁怒士兵",
		[8909] = "火焰卫士",
		[8925] = "掘泥虫",
		[5260] = "格罗多克猿人",
		[8957] = "怒爪灰熊",
		[8521] = "荒芜水元素",
		[2761] = "水浪流放者",
		[6379] = "雷首角鹰雄兽",
		[9241] = "燃棘猎头者",
		[9037] = "格鲁雷尔",
		[2760] = "烈焰流放者",
		[4849] = "暗炉考古学家",
		[1863] = "拜特欧拉",
		[3261] = "刺背织棘者",
		[1397] = "霜鬃先知",
		[1388] = "瓦加什",
		[9042] = "维雷克",
		[9165] = "小翼手龙",
		[5616] = "废土窃贼",
		[7671] = "瑟温妮的仆从",
		[4844] = "暗炉勘探员",
		[13323] = "地下双帆龙",
		[5648] = "沙怒暗影法师",
		[9261] = "火印暗法师",
		[1417] = "湿地鳄鱼幼崽",
		[206] = "夜行邪齿狼人",
		[7727] = "恐怖图腾萨满祭司",
		[1186] = "老黑熊",
		[1852] = "召唤者阿拉基",
		[10489] = "复活的卫兵",
		[5712] = "祖罗",
		[5720] = "德拉维沃尔",
		[8553] = "亡灵巫师",
		[11472] = "艾德雷斯鬼巫",
		[11484] = "畸形残渣",
		[9453] = "亚奎门塔斯",
		[11688] = "被诅咒的半人马",
		[8979] = "格鲁克拉什",
		[11744] = "灰尘风暴",
		[4857] = "石头看守者",
		[11441] = "戈多克蛮兵",
		[10809] = "石脊",
		[7855] = "南海海盗",
		[7291] = "加加恩·火锤",
		[7138] = "铁木游荡者",
		[8891] = "铁怒卫士",
		[5840] = "黑铁锻造师",
		[2925] = "银鬃嗥狼",
		[5856] = "晶网蜘蛛",
		[9677] = "奥格拉比斯",
		[9693] = "血斧招魂师",
		[7209] = "黑曜石碎片 <黑曜石哨兵>",
		[11582] = "通灵学院黑暗召唤师",
		[11788] = "岩石虫",
		[10217] = "烈焰打击图腾 <燃棘巫医>",
		[8138] = "苏利萨斯幼崽",
		[1837] = "血色法官",
		[764] = "沼泽漫步者",
		[2595] = "刺脊袭击者",
		[9694] = "流涎的灰烬座狼",
		[10979] = "血色猎犬",
		[7290] = "暗炉狙击手",
		[12352] = "血色骑兵",
		[9462] = "血喉酋长",
		[9543] = "雷布里·斯库比格特",
		[5992] = "野猪",
		[10435] = "巴瑟拉斯镇长",
		[6008] = "魔誓术士",
		[6016] = "防护元素图腾 <燃棘巫医>",
		[11473] = "未知目标",
		[10482] = "复活的侍从 <通灵学院黑暗召唤师>",
		[12076] = "熔岩元素",
		[8095] = "苏利萨斯沙行者",
		[10436] = "安娜丝塔丽男爵夫人",
		[12143] = "烈焰之子",
		[5253] = "木爪蛮兵",
		[8127] = "安图苏尔",
		[13743] = "腐化的自然之力",
		[10043] = "雷布里的亲信",
		[822] = "森林熊幼崽",
		[12220] = "蟒藤",
		[2599] = "奥图",
	},
	["death_recap"] = {
		["enabled"] = true,
		["show_segments"] = false,
		["show_life_percent"] = false,
		["relevance_time"] = 7,
	},
	["spell_pool"] = {
		1, -- [1]
		3, -- [2]
		[0] = 1,
		["叉状闪电"] = "尖石秘法师",
		["法术反制"] = 8,
		["致盲"] = 4,
		["银色黎明"] = 1,
		["邪恶攻击"] = 4,
		["催眠曲"] = "弗雷斯特恩",
		["枭兽光环"] = 11,
		["恢复"] = "穆尔塔",
		["安抚之吻"] = "布雷维恩 <Edge>",
		["救赎之魂"] = 5,
		["召唤座狼幼崽"] = 5,
		["十字军圣印"] = 2,
		["深度沉睡"] = "伊兰尼库斯的阴影",
		["制造魔法红宝石"] = 8,
		["急救"] = 11,
		["火焰的召唤"] = "艾德雷斯幻像",
		["血之契印"] = 9,
		["真言术：韧"] = 5,
		["强效力量祝福"] = 2,
		["灰尘力场"] = "瑟莱德丝公主",
		["打磨利刃 V"] = 1,
		["撕碎"] = 11,
		["复苏之风"] = 2,
		["烹制甜点"] = "曲奇",
		["调整"] = 4,
		["致伤毒药"] = 4,
		["疲劳诅咒"] = 9,
		["荆棘术"] = 11,
		["上古狂乱"] = "上古熔火恶犬",
		["召唤传送门"] = "哈卡莱护血者",
		["渐隐术"] = 5,
		["惊骇之爪"] = 4,
		["冷酷"] = 4,
		["闪光炸弹"] = "工匠吉兹洛克",
		["毒云术"] = 3,
		["次级力量"] = 4,
		["驯服大型峭壁野猪"] = 3,
		["清洁术"] = 2,
		["安抚心灵"] = 5,
		["宁神射击"] = 3,
		["灼热武器"] = 2,
		["乌瑟尔之光效果"] = 2,
		["横扫猛击"] = "阿塔拉利恩",
		["雷霆一击"] = 1,
		["龙王印记"] = 2,
		["召唤战马"] = 2,
		["病弱"] = "掘泥虫",
		["火焰爆发"] = "伊森迪奥斯",
		["喂养宠物"] = 3,
		["血之诅咒"] = "维雷克",
		["愤怒之锤"] = 2,
		["加速光环"] = "铁怒监军",
		["灵猴守护"] = 3,
		["制造遗物包裹"] = 8,
		["寒冰屏障"] = 8,
		["末日降临"] = "鲁西弗隆",
		["鞭根块茎"] = 11,
		["污染光环"] = "马杜克·布莱克波尔",
		["尸爆"] = "通灵学院亡灵法师",
		["虚弱诅咒"] = "欧罗·血眼",
		["召唤仆人"] = 4,
		["心灵震爆"] = 5,
		["冰链术"] = "艾德雷斯鬼怪",
		["闪电吐息"] = "风蛇",
		["侦测潜行"] = 1,
		["爆炸死尸"] = "破碎的死尸 <被毁坏的死尸>",
		["火焰之花"] = "火焰行者",
		["防护火焰"] = 3,
		["巨熊形态"] = 11,
		["斧类武器投掷"] = "地精木匠",
		["召唤玩家"] = "比斯巨兽",
		["切割"] = 4,
		["冰冻术"] = "盖斯",
		["刺骨暗影"] = "图萨丁暗影法师",
		["出血"] = 4,
		["无敌"] = 9,
		["猎人护甲充能"] = 3,
		["复活术"] = 5,
		["多重射击"] = 3,
		["破釜沉舟"] = 1,
		["心灵视界"] = 5,
		["魔纹绷带"] = "大葱法",
		["毒液箭"] = "毒劣魔",
		["音素爆破"] = "地下双帆龙",
		["献祭陷阱"] = 3,
		["治疗之触"] = 11,
		["黑暗祭品"] = "沙怒噬魂者",
		["寒冰之墓"] = "苍白的玛勒基",
		["挥砍"] = "乌克兹·沙顶",
		["照明弹"] = 3,
		["朱莉叶的祝福"] = 4,
		["冰锥术"] = 8,
		["石拳"] = 2,
		["庇护"] = 1,
		["弹出斯尼德"] = "斯尼德的伐木机",
		["击昏"] = "吞咽者拉姆斯登",
		["制造强效灵魂石"] = 9,
		["制造魔法玛瑙"] = 8,
		["吸取灵魂"] = 9,
		["强效石盾"] = 1,
		["加兹瑞拉猛击"] = "加兹瑞拉",
		["打磨利刃 IV"] = 2,
		["挑战怒吼"] = 1,
		["黑曜石破碎"] = "黑曜石哨兵",
		["锤击昏迷效果"] = 4,
		["霜甲术"] = 8,
		["地狱烈焰效果"] = 9,
		["狂乱"] = "玛格曼达",
		["智力提高"] = 8,
		["杂色马"] = 8,
		["压制"] = 1,
		["震荡猛击"] = 1,
		["灵魂分流"] = "图萨丁亡灵法师",
		["智力"] = 1,
		["牺牲圣印"] = "暗炉农夫",
		["肾击"] = 4,
		["猛禽一击"] = 3,
		["感染撕咬"] = "奴役者基兹鲁尔",
		["冰冻"] = 8,
		["熔岩镣铐"] = "加尔",
		["毒性震击"] = "爬行污泥怪",
		["快速传染"] = "博学者普克尔特",
		["熔岩爆裂"] = "控火师罗格雷恩",
		["召唤恐惧战马"] = 9,
		["灵魂撕裂"] = "艾德雷斯鬼巫",
		["野兽知识"] = 3,
		["击倒"] = "洞窟潜伏者",
		["强效怒气"] = 1,
		["毒性钉刺"] = "腐蚀群居虫",
		["野性回复"] = "洞窟游荡者",
		["冰霜震击"] = "暮光之锤特使",
		["拉格纳罗斯之手"] = "萨弗隆先驱者",
		["寒冰护体"] = 8,
		["召唤阿塔莱死亡行者的灵魂"] = "阿塔莱死亡行者",
		["命令圣印"] = 2,
		["林克的回旋镖"] = 8,
		["刺破护甲"] = 4,
		["枪械射击"] = 1,
		["放置烟鬼的炸药"] = 11,
		["强效智慧祝福"] = 2,
		["死亡缠绕"] = 9,
		["毒性箭雨"] = "诺克赛恩",
		["强效拯救祝福"] = 2,
		["符文布绷带"] = 3,
		["灵魂哀嚎"] = "鬼灵研究员",
		["打击"] = "深腐践踏者",
		["战斗命令"] = "迪菲亚监工",
		["闪避"] = "腐烂巡影者",
		["召唤遥控傀儡"] = "地精工程师",
		["狂暴怒火"] = "巴瑟拉斯镇长",
		["疾病之云"] = "缝补憎恶",
		["火焰新星图腾"] = "安图苏尔",
		["熔岩之盾"] = "烈焰之子",
		["次级治疗术"] = 5,
		["神恩回复"] = 5,
		["燃烧"] = "达基萨斯将军",
		["女妖尖叫"] = "艾德雷斯鬼巫",
		["减速术"] = "破坏者奥科索尔",
		["腐蚀酸液吐息"] = "盖斯",
		["投掷黑铁啤酒"] = 9,
		["诱惑"] = "胡库的魅魔 <胡库>",
		["棕马"] = 1,
		["末日决战"] = "迦顿男爵",
		["炽热火焰"] = 4,
		["喝下治疗药水"] = "卫兵杜格瑞普",
		["盾牌冲锋"] = "红衣卫兵",
		["慢性毒药"] = "洞穴爬行者",
		["水流喷射"] = "塞萨拉多头怪",
		["防护火焰结界"] = 8,
		["重拳猛击"] = "重拳先生",
		["残废术"] = "图萨丁暗影法师",
		["生命偷取"] = 4,
		["追踪龙类"] = 3,
		["暗影之触"] = 9,
		["熊怪形态"] = 9,
		["毒蛇钉刺"] = 3,
		["导致疯狂"] = "哈卡的化身",
		["冰霜抗性光环"] = 2,
		["鬼魅攻击"] = 4,
		["折磨"] = "哈斯格拉夫 <Edge>",
		["意志之力"] = 1,
		["十字军打击"] = "红衣豪侠",
		["魔法吸收"] = 8,
		["召唤"] = "血斧召唤师",
		["水晶沉睡"] = "玉脊蜥蜴",
		["召唤虚空行者"] = 9,
		["召唤幻象"] = "詹迪斯·巴罗夫",
		["智慧圣印"] = 2,
		["刺破"] = "洛特格里普",
		["鬼魂装束"] = 11,
		["伊森哈德之怒"] = 1,
		["火焰之盾效果 IV"] = "石窟织炎者",
		["伤害增效"] = "暮光之锤特使",
		["血之狂热"] = 1,
		["烈焰之团"] = "铁手卫士",
		["百合根"] = 11,
		["枭兽形态"] = 11,
		["暗影之门"] = "黑暗院长加丁",
		["十字军之锤"] = "大十字军战士达索汉",
		["黑暗主宰诅咒"] = "黑暗院长加丁",
		["自然迅捷"] = 11,
		["潜伏"] = 3,
		["自毁"] = "石头看守者",
		["追踪亡灵"] = 3,
		["铁质盾刺"] = 1,
		["银色黎明委任徽章"] = 3,
		["蛆虫粘液"] = "瘟疫蛆",
		["诺格弗格药剂"] = 9,
		["挥击"] = 11,
		["神圣新星"] = 5,
		["缴械"] = 1,
		["蛛网爆炸"] = "爬行者赫杜姆",
		["煽动烈焰"] = "火焰行者",
		["安图苏尔的爪牙"] = "安图苏尔",
		["急奔"] = 11,
		["放逐术"] = 9,
		["上钩拳"] = "诺克赛恩",
		["强效护甲"] = 1,
		["吸取法力"] = 9,
		["重拳先生践踏"] = "重拳先生",
		["精神鞭笞"] = 5,
		["速效毒药 V"] = 4,
		["熔铁之水"] = "基尔尼格",
		["撞击"] = "熔核巨人",
		["破甲攻击"] = 1,
		["死尸虫"] = "被撕裂的死尸",
		["受难"] = "哈斯格拉夫 <Edge>",
		["毁坏之痛"] = "暮光之锤拷问者",
		["生命回复"] = 1,
		["变形术"] = 8,
		["火焰箭"] = "胡库的小鬼 <胡库>",
		["野性冲锋"] = 11,
		["抵抗火焰"] = "裂盾缚法师",
		["Warder Despawn"] = "安图苏尔",
		["栗色马"] = 8,
		["恐吓咆哮"] = "比斯巨兽",
		["恶毒撕裂"] = "剜眼者",
		["盾牌壁垒"] = 2,
		["神圣之灵"] = 5,
		["圣光击"] = "穆尔塔",
		["闪电箭"] = "阿塔莱巫医",
		["破甲顺劈"] = "拉文尼亚",
		["培植种子"] = 1,
		["召唤阿塔莱骷髅"] = "阿塔莱图腾 <祖罗>",
		["禁闭"] = "黑手监禁者",
		["穿刺"] = "燃棘猎头者",
		["猛击"] = 1,
		["黑暗瘟疫"] = "复生的尸体",
		["闪电之盾"] = "傀儡统帅阿格曼奇",
		["复仇昏迷"] = 1,
		["野性冲锋效果"] = 11,
		["昏阙"] = 5,
		["地狱火罩"] = "石窟织炎者",
		["毒药"] = "拉文",
		["专注光环"] = 2,
		["喷酒"] = "践踏者克雷格",
		["复活亡灵甲虫"] = "奈鲁布恩坎",
		["圣佑术"] = 2,
		["守护之刺"] = 3,
		["艾露恩的赐福"] = 5,
		["挫志咆哮"] = 11,
		["法力护盾"] = 8,
		["鬼魅幻影"] = "鬼魂市民",
		["龙翼攻击"] = "奥妮克希亚",
		["追踪人型生物"] = 3,
		["侦测魔法"] = 8,
		["白山羊"] = 1,
		["伊莫塔尔之眼"] = "伊莫塔尔",
		["抗性"] = 2,
		["拉格纳罗斯之拳"] = "暮光保镖",
		["裂筋"] = "暗炉农夫",
		["倒钩"] = "尖刺鞭笞者",
		["闪耀徽章"] = 1,
		["幼虫粘液"] = "邪恶幼虫",
		["黑暗打击"] = "戈多克领主",
		["尖牙撕咬"] = "熔火恶犬",
		["力量"] = 1,
		["敏捷"] = 3,
		["熟化厚毛皮"] = 3,
		["热疫"] = "殉教者塞卡",
		["生命虹吸"] = 9,
		["盾墙"] = 1,
		["驱散射击"] = 3,
		["辩护"] = 2,
		["烈焰之矛"] = "萨弗隆先驱者",
		["迅捷霜刃豹"] = 1,
		["毒性鱼叉"] = "绿皮队长",
		["进食"] = 4,
		["血帆鹦鹉"] = "迪菲亚海盗",
		["剧烈震颤"] = "熔核摧毁者",
		["元素大师"] = 8,
		["救赎"] = 2,
		["战斗怒吼"] = 1,
		["邪恶光环"] = "瑞文戴尔男爵",
		["召唤雷德·黑手"] = "盖斯",
		["灼热之痛"] = 9,
		["听觉震荡"] = "黑暗尖啸者",
		["冲锋击昏"] = 1,
		["阿塔莱骷髅图腾"] = "祖罗",
		["召唤军马"] = 2,
		["猎豹守护"] = 3,
		["召唤尖塔小蜘蛛"] = "尖塔蜘蛛",
		["致命毒药"] = "塞萨拉多头怪",
		["大地震颤"] = "阿塔拉利恩",
		["盾牌猛击"] = "洛若尔",
		["黑标美味朗姆酒"] = 11,
		["胡库的卫士"] = "胡库",
		["沙斯拉尔的诅咒"] = "沙斯拉尔",
		["群体打击"] = "奥格拉比斯",
		["喝水"] = 8,
		["急速射击"] = 3,
		["精灵之火"] = 11,
		["横扫攻击"] = 1,
		["制造特效灵魂石"] = 9,
		["恶魔学识大师"] = 9,
		["野葡萄药水"] = 8,
		["乱舞"] = 1,
		["火焰强化"] = 9,
		["疾病喷吐"] = "瘟疫龙崽",
		["坚定信念"] = 8,
		["冰霜射击"] = "武器技师",
		["神圣力量"] = 1,
		["投石"] = "原始巨兽",
		["鲁西弗隆的诅咒"] = "鲁西弗隆",
		["毒蝎钉刺"] = 3,
		["盾击 - 沉默"] = 1,
		["冲击波"] = "血斧招魂师",
		["投掷岩石"] = 11,
		["偷袭"] = 4,
		["分裂"] = "熔岩爪牙 <火焰之王>",
		["刺穿护甲"] = "噩梦游荡者",
		["休眠"] = 11,
		["奥术光辉"] = 8,
		["驱散魔法"] = "塞雷布拉斯树妖",
		["能量灌注"] = 5,
		["熔化护甲"] = "烈焰守卫",
		["智慧祝福"] = "无可救药先生",
		["远古之怒"] = 4,
		["蛛后的乳汁"] = "烟网蛛后",
		["猫鼬撕咬"] = 3,
		["制造魔法黄水晶"] = 8,
		["召唤黑曜石碎片"] = "黑曜石哨兵",
		["王者祝福"] = 2,
		["嫩狼肉排"] = 9,
		["致死打击"] = 1,
		["闪现术"] = 8,
		["复活节糖果"] = 11,
		["制造灵魂石"] = 9,
		["脚踢"] = "铁怒步兵",
		["恐惧嚎叫"] = 9,
		["Lava"] = "环境伤害 (岩浆)",
		["野兽之眼"] = 3,
		["祖穆拉恩结界"] = "巫医祖穆拉恩",
		["复活宠物"] = 3,
		["逃命专家"] = 8,
		["追踪恶魔"] = 3,
		["战士的决心"] = 1,
		["拦截昏迷"] = 1,
		["杀死乌洛克的爪牙"] = "Challenge to Urok Trap",
		["狂热"] = 4,
		["剧痛鞭笞"] = "未知目标 <胡库>",
		["厚亚麻绷带"] = 2,
		["疾跑"] = 4,
		["灼烧之焰"] = "上古熔火恶犬",
		["恶性毒药"] = "灰尘怨灵",
		["野性赐福"] = 11,
		["盾牌专精"] = 1,
		["脆弱"] = "祖罗尔",
		["衰弱之触"] = "鬼魂市民",
		["高爆炸弹"] = 3,
		["快速治疗"] = "沙怒巫医",
		["冬泉火酒"] = 1,
		["冰霜陷阱"] = 3,
		["龙息红椒"] = 11,
		["冲动"] = 4,
		["红色机械陆行鸟"] = 8,
		["心灵尖啸"] = "暗影祭司塞瑟斯",
		["暗影震击"] = "大十字军战士达索汉",
		["弩射击"] = 1,
		["炮火"] = "炮弹",
		["燃烧之风"] = "档案管理员加尔福特",
		["月火术"] = 11,
		["奇特的朗姆酒"] = 1,
		["岩浆喷溅"] = "贝尔加",
		["火焰新星"] = "加加恩·火锤",
		["石像鬼打击"] = "石翼尖啸者",
		["缩小射线"] = 1,
		["暴风雪"] = 8,
		["召唤骷髅"] = 8,
		["震地者"] = 1,
		["爆炸陷阱"] = 3,
		["冰甲术"] = 8,
		["召唤瑟莱德丝碎片"] = "瑟莱德丝卫士",
		["清算圣印"] = "弗诺斯·达克维尔",
		["战斗姿态"] = 1,
		["龙鳞之心"] = 8,
		["灵魂虹吸"] = 9,
		["灵魂石复活"] = 9,
		["火焰弹"] = 3,
		["召唤地狱战马"] = 9,
		["狂野怒火"] = 3,
		["致命毒药 IV"] = 4,
		["熔岩冲击"] = "拉格纳罗斯",
		["魔法反射"] = "管理者埃克索图斯",
		["星火术"] = 11,
		["全力一击"] = "伊森迪奥斯",
		["惩戒痛击"] = 1,
		["灵魂撕咬"] = "沙怒噬魂者",
		["嗜血"] = 1,
		["恐吓嚎叫"] = "石翼尖啸者",
		["血色幻象"] = 1,
		["炉石"] = 3,
		["神圣干涉"] = 2,
		["正义圣印"] = 2,
		["神恩术"] = 2,
		["震耳尖啸"] = "尖叫的女妖",
		["火焰风暴"] = "伊森迪奥斯",
		["学识爆发"] = 9,
		["海盗装束"] = 11,
		["忍者装束"] = 2,
		["灵魂链接"] = 9,
		["哀嚎死者"] = "亡灵邮差",
		["熔岩吐息"] = "上古熔火恶犬",
		["召唤宠物"] = 3,
		["火焰使者驱散"] = 3,
		["智慧审判"] = 2,
		["枯萎热浪"] = "上古熔火恶犬",
		["奉献"] = 2,
		["削骨之刃"] = 1,
		["凶猛撕咬"] = 11,
		["土灵卫士被摧毁"] = "土灵筑厅师",
		["召唤水元素"] = "红衣魔术师",
		["元素诅咒"] = 9,
		["醉酒怒气"] = "霍尔雷·黑须",
		["显现灵魂"] = 1,
		["暗影之盾"] = "阿塔莱高阶祭司",
		["恶毒之咬"] = "上古熔火恶犬",
		["凋零之触"] = "复活的守护者",
		["烈焰弹"] = 3,
		["强效光明祝福"] = 2,
		["奥法药剂"] = 8,
		["戈多克绿酒"] = 1,
		["憎恨怒视"] = "瑟莱德丝公主",
		["圣洁光环"] = 2,
		["短暂强力"] = 8,
		["畏缩"] = 11,
		["强效敏捷"] = 4,
		["破甲"] = 4,
		["蜥蜴之矢"] = "洞穴雷霆蜥蜴",
		["制造特效治疗石"] = 9,
		["尖刺水晶"] = 1,
		["强效王者祝福"] = 2,
		["暗影形态"] = 5,
		["造食术"] = 8,
		["槌击"] = 11,
		["纠缠"] = "特迪斯·扭木",
		["强化震荡射击"] = 3,
		["十字军审判"] = 2,
		["耐力"] = 2,
		["防护元素图腾"] = "燃棘巫医",
		["自然之赐"] = 11,
		["拉姆斯登的闪电钉"] = 9,
		["献祭"] = 9,
		["奥术强化"] = 8,
		["淹没"] = "海多斯博恩",
		["无情"] = 4,
		["斯坦索姆圣水"] = 4,
		["秘银盾刺"] = 1,
		["厚魔纹绷带"] = 9,
		["奥术射击"] = 3,
		["拉克佐猛击"] = "拉克佐",
		["蛛网"] = "洞穴爬行者",
		["黑暗符文"] = 3,
		["Fire"] = "环境伤害 (火烧)",
		["沉默"] = "暗炉发掘者",
		["乱射"] = 3,
		["烈焰"] = "达格兰·索瑞森大帝",
		["攻击"] = "灼烧图腾 <控火师罗格雷恩>",
		["变形！"] = 1,
		["治疗之环"] = 2,
		["驱邪术"] = 2,
		["专注施法"] = 5,
		["传送到玩家"] = "奥妮克希亚雏龙",
		["战争践踏"] = "深腐践踏者",
		["割碎"] = "熔火怒犬",
		["纯净术"] = 2,
		["光明圣印"] = 2,
		["巨石之力"] = 2,
		["生命 II"] = 8,
		["穿刺射击"] = "迪菲亚工头",
		["腐化传染"] = 1,
		["逃脱"] = 3,
		["旋风斩效果"] = "修行者高罗什",
		["伺机待发"] = 4,
		["精神祷言"] = 5,
		["摔绊"] = 3,
		["力量祝福"] = 2,
		["亚麻绷带"] = 3,
		["包围之网"] = "阿努希尔",
		["爆炸射击"] = "厄炉龙骑兵",
		["炽热之地"] = "奥妮克希亚",
		["治疗波"] = "巫医祖穆拉恩",
		["!Melee"] = 1,
		["扰乱之痛"] = "斯尼德的伐木机",
		["影遁"] = 3,
		["石像形态"] = 1,
		["愈合"] = 11,
		["召唤魅魔"] = "远古吟唱",
		["酸液喷射"] = "噩梦龙族",
		["审判"] = 2,
		["投掷炸弹"] = "暗炉农夫",
		["伊莫塔尔传送门"] = "伊莫塔尔",
		["回春术"] = 11,
		["狂暴回复"] = 11,
		["酸息术"] = "德拉维沃尔",
		["蝰蛇钉刺"] = 3,
		["死亡之愿"] = 1,
		["恶魔牺牲"] = 9,
		["条纹夜刃豹"] = 4,
		["献祭陷阱效果"] = 3,
		["反射"] = "玉脊蜥蜴",
		["猛虎之怒"] = 11,
		["冰冻陷阱效果"] = 3,
		["戈多克之王"] = "米兹勒",
		["腐烂蛋白"] = "钻孔甲虫",
		["追踪隐藏生物"] = 3,
		["盾刺"] = "噩梦刃鳞龙人",
		["飓风"] = 11,
		["灵魂燃烧"] = "火焰之王",
		["冰霜陷阱光环"] = 3,
		["暗影迷雾"] = "幽灵市民",
		["灵感"] = 5,
		["荆棘光环"] = "米杉",
		["困兽之爪"] = "巨型血犬",
		["荆棘箭雨"] = "尖刺鞭笞者",
		["召唤红衣火枪手"] = "炮手威利",
		["公正圣印"] = 2,
		["寒冰箭"] = 8,
		["元素领主的诅咒"] = "伊森迪奥斯",
		["巨人药剂"] = 3,
		["强效治疗术"] = 5,
		["制裁之锤"] = 2,
		["激流"] = "海多斯博恩",
		["治疗药水"] = 1,
		["新近包扎"] = 11,
		["自动射击"] = 3,
		["汹涌"] = "熔岩奔腾者",
		["救助者的牺牲"] = 1,
		["眩晕"] = 3,
		["真言术：盾"] = "穆尔塔",
		["自杀"] = "阿莎利水晶",
		["厚甲蝎之击"] = 2,
		["血性狂暴"] = 1,
		["颅骨烙印"] = 4,
		["防护恐惧结界"] = 5,
		["反手一击"] = "铁怒军官",
		["毒液喷吐"] = "掘泥虫",
		["神圣之盾"] = 2,
		["治疗链"] = "燃棘秘法师",
		["重击"] = 11,
		["恐吓"] = "斯尼德的伐木机",
		["多彩混乱"] = "维克多·奈法里奥斯",
		["火息术"] = "霍尔雷·黑须",
		["随机装束"] = 11,
		["重创"] = 4,
		["烈焰打击"] = "土灵雕刻者",
		["牺牲"] = "哈斯格拉夫 <Edge>",
		["恶魔耐力"] = 9,
		["法力回复"] = 11,
		["棕山羊"] = 3,
		["铁皮手雷"] = 3,
		["恶魔能量"] = 9,
		["割裂"] = 4,
		["搜索"] = 4,
		["银色复仇者"] = 4,
		["治疗石"] = 9,
		["圣光审判"] = 2,
		["速效毒药 VI"] = 4,
		["投掷"] = "塞雷布拉斯树妖",
		["护甲"] = 1,
		["无荣誉目标"] = 1,
		["射击"] = 9,
		["屠魔药剂"] = 1,
		["冰霜新星"] = 8,
		["还击"] = 4,
		["烈焰鞭笞"] = "暗炉地质学家",
		["清算"] = 9,
		["补充法力"] = 8,
		["上古恐慌"] = "上古熔火恶犬",
		["厚皮"] = 3,
		["连发寒冰箭"] = "莱斯·霜语",
		["冲击"] = 8,
		["点燃法力"] = "迦顿男爵",
		["深冬之寒"] = 8,
		["火焰之雨"] = 9,
		["法力燃烧"] = "沙怒侍僧",
		["荆棘诅咒"] = "黑手恐法师",
		["生命分流"] = 9,
		["鲁莽"] = "铁怒士兵",
		["进食充分"] = 1,
		["破甲虚弱"] = "巨型血犬",
		["召唤破碎的死尸"] = "被毁坏的死尸",
		["生命的恩赐"] = 4,
		["地狱火"] = "迦顿男爵",
		["活化烈焰"] = "活火 <迪菲亚法师>",
		["正义之怒"] = 2,
		["掷斧"] = "指挥官沃恩",
		["突进"] = "龟苓膏 <全弹发射>",
		["恢复法力"] = 11,
		["潜行"] = 11,
		["召唤黑手老兵"] = "黑手召唤师",
		["燃灵术"] = "弗莱拉斯大使",
		["夜龙之息"] = 2,
		["统御意志"] = "伊露希亚·巴罗夫",
		["刺耳怒吼"] = 1,
		["挫志怒吼"] = 1,
		["裂盾传送门"] = "裂盾术士",
		["痛击"] = "苏利萨斯幼崽",
		["狂怒之嚎"] = 3,
		["消隐"] = "迪菲亚黑衣卫兵",
		["激活"] = 11,
		["基尔罗格之眼"] = 9,
		["烈焰打击图腾"] = "燃棘巫医",
		["火屑弹幕"] = "熔岩元素",
		["复仇"] = "布莱中士",
		["召唤祖尔法拉克僵尸"] = "祖尔法拉克僵尸",
		["解除次级诅咒"] = 8,
		["条纹霜刃豹"] = 3,
		["制造治疗石"] = 9,
		["潜行者护甲充能"] = 4,
		["星辰碎片"] = 5,
		["制造初级灵魂石"] = 9,
		["防护冰霜结界"] = "典狱官斯迪尔基斯",
		["火焰突变"] = "比斯巨兽",
		["剥皮"] = 3,
		["狂怒"] = "沙怒狂热者",
		["吸取生命"] = 9,
		["致残毒药"] = 4,
		["启发"] = 2,
		["灼烧图腾"] = "控火师罗格雷恩",
		["暗影箭雨"] = "巫医祖穆拉恩",
		["精灵之火（野性）"] = 11,
		["烈焰火炮"] = "怒锤傀儡",
		["酸液溅射"] = "曲奇",
		["胁迫"] = 3,
		["消失"] = 4,
		["破胆咆哮"] = "乌洛克",
		["强效治疗石"] = 9,
		["扰乱射击"] = 3,
		["猎人印记"] = 3,
		["蓝色机械陆行鸟"] = 1,
		["吸血一击"] = "巴瑟拉斯镇长",
		["腐蚀酸液"] = "博学者普克尔特",
		["拉格纳罗斯之怒"] = "暮光使者",
		["影像投射"] = "鬼灵导师",
		["低沉咆哮"] = "奥妮克希亚",
		["狂暴冲锋"] = "比斯巨兽",
		["超强治疗结界"] = "燃棘巫医",
		["诱捕"] = 3,
		["神圣震击"] = 2,
		["治疗术"] = "暗影祭司塞瑟斯",
		["纠缠根须"] = "深腐纠缠者",
		["烈焰化身"] = "达格兰·索瑞森大帝",
		["制造百合根"] = 11,
		["物理防护"] = 11,
		["旅行形态"] = 11,
		["次级隐形术"] = "布雷维恩 <Edge>",
		["恐慌"] = "玛格曼达",
		["迅捷棕山羊"] = 4,
		["唤醒"] = 8,
		["心灵之火"] = 5,
		["飞扑"] = "哈卡莱霜翼飞蛇",
		["火球术"] = 8,
		["盾牌格挡"] = 1,
		["烈焰震击"] = "洛考尔",
		["血腥撕裂者"] = 4,
		["火焰增效"] = "加加恩·火锤",
		["拯救祝福"] = 2,
		["召唤黑手恐法师"] = "黑手召唤师",
		["支配"] = "大十字军战士达索汉",
		["魔爆术"] = 8,
		["糖水茶"] = 3,
		["原始狂怒"] = 11,
		["大地践踏"] = "上古熔火恶犬",
		["嗜血术"] = "格瑞姆洛克",
		["补充营养"] = 3,
		["英勇打击"] = 1,
		["激怒"] = 11,
		["狂暴之怒"] = 1,
		["正义审判"] = 2,
		["麻痹之毒"] = "爬行者赫杜姆",
		["爪击"] = "龟苓膏 <全弹发射>",
		["烈焰尖刺"] = "暗炉地质学家",
		["剑刃乱舞"] = 4,
		["治疗龙类"] = "黑手驭龙者",
		["治疗祷言"] = 5,
		["快速射击"] = 3,
		["断筋"] = 1,
		["精神错乱"] = 5,
		["突袭"] = 11,
		["地震术"] = "安图苏尔",
		["恐怖低吼"] = "血犬",
		["侦测强效隐形"] = 9,
		["自律"] = 2,
		["种植林精种子"] = 8,
		["召唤熔岩爪牙"] = "火焰之王",
		["瘟疫之云"] = "圣甲虫",
		["恶魔符文"] = 11,
		["结晶"] = "尖塔蜘蛛",
		["暗影抗性光环"] = 2,
		["召唤小软泥怪"] = "深色软泥怪",
		["致死顺劈"] = "克罗卡斯",
		["洛丹伦的回响"] = 1,
		["火焰之盾 IV"] = "土灵雕刻者",
		["大地粉碎"] = "狂热的玛洛尔",
		["惩罚光环"] = 9,
		["覆体之网"] = "地穴兽",
		["敏捷提高"] = 1,
		["斑点霜刃豹"] = 11,
		["鲁莽诅咒"] = 9,
		["反魔法盾"] = "剜眼者",
		["黑色腐烂"] = "瘟疫鼠",
		["反击风暴"] = 1,
		["腐蚀术"] = 9,
		["宁静"] = 11,
		["地精暗雷"] = "维格利",
		["分离"] = "洞穴雷霆蜥蜴",
		["狂暴姿态"] = 1,
		["钩网"] = "温格",
		["强效庇护祝福"] = 1,
		["火焰之盾效果 III"] = "暗炉议员",
		["天堂祝福"] = 1,
		["感知亡灵"] = 2,
		["吞噬暗影"] = "格拉兹萨克 <艾米莉>",
		["地精龙枪"] = "工匠吉兹洛克",
		["冰冻新星"] = "莱斯·霜语",
		["扰乱"] = 4,
		["火焰之盾"] = 9,
		["奥术智慧"] = 8,
		["往日的尖啸"] = "狂怒的幻影 <Anne>",
		["骷髅装束"] = 11,
		["筛盐器"] = 3,
		["娜玛拉消失"] = "罗克诺特下士",
		["迅捷雾刃豹"] = 1,
		["强效隐形"] = "纳克萨玛斯之眼",
		["闪电链"] = "安图苏尔",
		["气定神闲"] = 8,
		["火印诅咒"] = "火印暗法师",
		["奥术箭"] = "厄炉魔匠",
		["急速冷却"] = 8,
		["麻风侏儒装束"] = 1,
		["暗影灼烧"] = 9,
		["屠杀"] = "暮光之锤刽子手",
		["惩击"] = 5,
		["治疗宠物"] = 3,
		["吸血鬼的拥抱"] = 5,
		["僵化"] = "苏利萨斯沙行者",
		["地穴甲虫"] = "地穴爬行者",
		["侏儒死亡射线"] = 1,
		["驱除疾病"] = 5,
		["恶魔皮肤"] = "沙怒暗影法师",
		["烟雾弹"] = "维利塔恩",
		["治疗结界"] = "沙怒巫医",
		["火焰冲击"] = 8,
		["坚韧祷言"] = 5,
		["拳击"] = 1,
		["冰霜凝固"] = "加兹瑞拉",
		["唤醒地灵宝库守卫"] = "阿扎达斯",
		["魔法增效"] = 8,
		["灵魂支配"] = 1,
		["瞄准射击"] = 3,
		["血袭"] = 11,
		["脓疮撕咬"] = "瘟疫虫",
		["疾病爆发"] = "虚弱的尸体",
		["食尸鬼瘟疫"] = "恶疫食尸鬼",
		["旋风斩"] = 1,
		["俯冲"] = "清补凉 <全弹发射>",
		["防护暗影结界"] = 9,
		["缩小"] = 1,
		["熔化矿石"] = "地精工匠",
		["复生"] = 11,
		["佯攻"] = 4,
		["豹群守护"] = 3,
		["恐惧术"] = 9,
		["水"] = "巨型喷泉 <海多斯博恩>",
		["防御姿态"] = 1,
		["水栖形态"] = 11,
		["圆弧斩"] = "艾隆纳亚",
		["拍翼"] = "德姆塞卡尔",
		["扫击"] = 11,
		["堕落自然之力"] = "被诅咒的塞雷布拉斯",
		["恶魔支配"] = 9,
		["奥术之力"] = "红衣法术师",
		["解散野兽"] = 3,
		["盾击"] = 1,
		["圣盾术"] = "铁怒军官",
		["绞喉"] = 4,
		["活化炸弹"] = "迦顿男爵",
		["强效奥法药剂"] = 8,
		["炸弹"] = "维格利",
		["游荡瘟疫"] = 2,
		["击退"] = "兰斯利德",
		["暴怒"] = 1,
		["厚符文布绷带"] = 9,
		["点燃"] = 8,
		["召唤小鬼"] = 9,
		["神圣打击"] = "铁怒队长",
		["烈焰印记"] = "火印步兵",
		["侦测次级隐形"] = 9,
		["霜寒刺骨"] = 8,
		["蝙蝠装束"] = 4,
		["暗影易伤"] = 5,
		["践踏"] = "原始巨兽",
		["撕咬"] = "狼 <艾奥里亚>",
		["感染之伤"] = "祖尔法拉克阵亡英雄",
		["投网"] = "玛拉多斯",
		["巨型喷泉"] = "海多斯博恩",
		["熔岩喷射图腾"] = "沙怒巫医",
		["暗言术：痛"] = "沙怒暗影法师",
		["魔息术"] = 9,
		["虚弱灵魂"] = 5,
		["自然之握"] = 11,
		["沙尘风暴"] = "古代的石头看守者",
		["反魔法脉冲"] = "加尔",
		["驯服野兽"] = 3,
		["召唤劫掠者"] = "克罗卡斯",
		["重伤"] = 1,
		["撕裂"] = 1,
		["嘲讽"] = 1,
		["召唤复活的侍从"] = "通灵学院黑暗召唤师",
		["爆炸陷阱效果"] = 3,
		["召唤贝尔加的产物"] = "贝尔加",
		["召唤水浪幼崽"] = "海多斯博恩",
		["野性印记"] = 11,
		["神圣太阳果汁"] = 5,
		["强击光环"] = 3,
		["驯服冰爪熊"] = 3,
		["弓射击"] = 1,
		["基尔图诺斯变形"] = "传令官基尔图诺斯",
		["熔岩喷溅"] = "焚化者古雷曼格",
		["昏迷炸弹"] = "军需官兹格雷斯",
		["迅捷棕马"] = 4,
		["暗影冥思"] = 9,
		["暗影屏障"] = "红衣审查者",
		["命令审判"] = 2,
		["伏击"] = 4,
		["精神"] = 5,
		["瑟银盾刺"] = 2,
		["召唤狂怒的幻影"] = 2,
		["蛮力药剂"] = 4,
		["怒不可遏"] = 1,
		["安格弗的剑"] = 4,
		["Falling"] = "环境伤害 (高处坠落)",
		["拦截"] = 1,
		["陷地图腾"] = "安图苏尔",
		["传送"] = "管理者埃克索图斯",
		["感知"] = 8,
		["刺骨"] = 4,
		["震荡射击"] = 3,
		["速效毒药 IV"] = 4,
		["树皮术"] = 11,
		["语言诅咒"] = "哈卡的化身",
		["毒害之灾"] = "腐化劣魔",
		["元素火焰"] = "拉格纳罗斯",
		["女妖哀嚎"] = "尖叫的女妖",
		["神圣之火"] = 5,
		["范克里夫的盟友"] = "艾德温·范克里夫",
		["符文布卷"] = 9,
		["奥术集中"] = "鬼灵教师",
		["闷棍"] = 4,
		["圣光闪现"] = 2,
		["安图苏尔的治疗波"] = "安图苏尔",
		["威慑"] = 3,
		["耐普图隆的守护"] = 1,
		["!Autoshot"] = 1,
		["斩杀"] = 1,
		["牺牲祝福"] = 2,
		["诅咒增幅"] = 9,
		["伤害反射护盾"] = "烈焰行者精英",
		["女妖诅咒"] = "哀嚎的女妖",
		["烈焰风暴"] = 8,
		["祸害之毒"] = "爬行者赫杜姆",
		["神圣太阳果"] = 4,
		["妖术"] = "沙怒暗影猎手",
		["黑暗契约"] = 9,
		["冰柱"] = "加兹瑞拉",
		["战斗狂怒"] = "暮光之锤刽子手",
		["血红之怒"] = "艾德雷斯怨魂",
		["兽群领袖"] = 11,
		["奥术冲击"] = "通灵学院管理者",
		["火锥术"] = "烈焰守卫",
		["熔岩喷吐"] = "玛格曼达",
		["次级智力"] = 2,
		["魔法抑制"] = 8,
		["低吼"] = "龟苓膏 <全弹发射>",
		["奥术飞弹"] = 8,
		["再生"] = 1,
		["爆发"] = "熔岩裂缝",
		["凿击"] = "拉文",
		["驯服雪豹"] = 3,
		["致伤"] = 1,
		["变异鱼大餐"] = 8,
		["追踪野兽"] = 3,
		["衰减魔法"] = "沙斯拉尔",
		["沙斯拉尔之门"] = "沙斯拉尔",
		["造水术"] = 8,
		["猫鼬药剂"] = 4,
		["召唤法力脉冲"] = "畸形残渣",
		["特效治疗石"] = 9,
		["天选印记效果"] = 8,
		["圣疗术"] = 2,
		["精神控制"] = 5,
		["庇护祝福"] = 2,
		["自由祝福"] = "荣誉",
		["雄鹰守护"] = 3,
		["虫群"] = 11,
		["驱毒术"] = 11,
		["强化治疗宠物"] = 3,
		["恼人孢子"] = "荆棘幼崽 <悠悠荡荡>",
		["震击"] = "傀儡统帅阿格曼奇",
		["速度"] = 9,
		["脚踢 - 沉默"] = 4,
		["无情打击效果"] = 4,
		["颅骨爆裂"] = "战斗傀儡",
		["暗影箭"] = "沙怒暗影法师",
		["倒钩之刺"] = "深渊钉刺者",
		["撕扯"] = 11,
		["束缚亡灵"] = 5,
		["恢复能量"] = 4,
		["漂浮术"] = 5,
		["清晰预兆"] = 11,
		["上古绝望"] = "上古熔火恶犬",
		["基赫纳斯的诅咒"] = "基赫纳斯",
		["假死"] = 3,
		["重建"] = "厄炉工匠",
		["痛苦诅咒"] = 9,
		["解除诅咒"] = 11,
		["星火昏迷"] = 11,
		["骨甲术"] = "图萨丁亡灵法师",
		["白骨熔化"] = "红衣铸锤师",
		["召唤哈卡"] = "哈卡的阴影",
		["减速毒药"] = "泼毒者",
		["恐吓野兽"] = 3,
		["精神分流"] = 5,
		["猎豹形态"] = 11,
		["次级不灭精华"] = 5,
		["光明祝福"] = 2,
		["愤怒"] = "被诅咒的塞雷布拉斯",
		["生命通道"] = 9,
		["自我治疗"] = 2,
		["保护祝福"] = 2,
		["魂能之力"] = 4,
		["裂颅"] = "扭木守护者",
		["冰冻陷阱"] = 3,
		["灼烧"] = "炽热火焰卫士",
		["呀啊啊啊啊"] = 9,
		["自爆"] = "地精暗雷 <维格利>",
		["火焰抗性光环"] = 2,
		["超度亡灵"] = 2,
		["麻痹毒药 III"] = 4,
		["鞭笞"] = "哈卡的化身",
		["虔诚光环"] = 2,
		["召唤碎片"] = "兰斯利德",
		["瓦罗什之痒"] = "瓦罗什",
		["地狱烈焰"] = 9,
		["迅捷治愈"] = 11,
		["守护效果"] = 1,
		["圣光术"] = 2,
		["神圣愤怒"] = 2,
		["召唤怀恨的幻影"] = 2,
		["防护暗影"] = 5,
		["破碎一击"] = "戈多克蛮兵",
		["扭曲"] = "厄炉工匠",
		["吐息"] = "奥妮克希亚",
		["背刺"] = "拉文",
		["耐力提高"] = 2,
		["催眠术"] = "噩梦龙族",
		["猛踢"] = "贾兹",
		["节能施法"] = 8,
		["哈卡酸液"] = "哈卡的后代",
		["M73破片手榴弹"] = 9,
		["唤醒地灵守护者"] = "阿扎达斯",
		["心灵专注"] = 5,
		["Enrage Trigger"] = "火誓者",
		["绝望祷言"] = 5,
		["尖啸"] = "清补凉 <全弹发射>",
		["追踪元素生物"] = 3,
		["制造强效治疗石"] = 9,
		["迅捷雷刃豹"] = 5,
		["消毒术"] = 11,
		["强化格挡"] = "噩梦刃鳞龙人",
		["凝视"] = "狂爪龙人",
		["召唤诺克赛恩产物"] = "诺克赛恩",
		["魔甲术"] = 9,
		["相位变换"] = "帕格匹特 <Edge>",
		["燃烧之愿"] = 9,
		["缠绕之藤"] = "特迪斯·扭木",
		["挑战咆哮"] = 11,
		["暗影诅咒"] = 9,
		["厄运诅咒"] = 9,
		["制造魔法翡翠"] = 8,
		["风花果"] = 11,
		["落雷之云"] = "奥术洪流",
		["冷血"] = 4,
		["超级能量合剂"] = 8,
		["进食充足"] = 8,
		["连珠火球"] = "火焰驱逐者",
		["吸血术"] = "沙怒饮血者",
		["破胆怒吼"] = 1,
		["暗影强化"] = 9,
		["火焰之盾 III"] = "暗炉议员",
		["炎爆术"] = "档案管理员加尔福特",
		["冲锋"] = 1,
		["怒气"] = "达基萨斯将军",
		["索瑞森之手"] = "达格兰·索瑞森大帝",
		["野性守护"] = 3,
		["黑暗治疗"] = "烈焰行者祭司",
		["顺劈斩"] = 1,
		["毁灭"] = 11,
		["龙尾扫击"] = "奥妮克希亚",
	},
	["encounter_spell_pool"] = {
		["叉状闪电"] = {
			0, -- [1]
			"尖石秘法师", -- [2]
		},
		["法术反制"] = {
			0, -- [1]
			"托塞德林王子", -- [2]
		},
		["回春术"] = {
			0, -- [1]
			11, -- [2]
		},
		["邪恶攻击"] = {
			0, -- [1]
			"黑须的亲信", -- [2]
		},
		["伊莫塔尔传送门"] = {
			0, -- [1]
			"伊莫塔尔", -- [2]
		},
		["恢复"] = {
			0, -- [1]
			"讲师玛丽希亚", -- [2]
		},
		["愈合"] = {
			0, -- [1]
			11, -- [2]
		},
		["飓风"] = {
			0, -- [1]
			11, -- [2]
		},
		["真言术：韧"] = {
			0, -- [1]
			"铁怒医师", -- [2]
		},
		["召唤红衣火枪手"] = {
			0, -- [1]
			"炮手威利", -- [2]
		},
		["寒冰箭"] = {
			0, -- [1]
			"苍白的玛勒基", -- [2]
		},
		["强效治疗术"] = {
			0, -- [1]
			5, -- [2]
		},
		["治疗药水"] = {
			663, -- [1]
			1, -- [2]
		},
		["召唤劫掠者"] = {
			0, -- [1]
			"克罗卡斯", -- [2]
		},
		["真言术：盾"] = {
			0, -- [1]
			"观察者克鲁什", -- [2]
		},
		["凋零之触"] = {
			0, -- [1]
			"复活的守护者", -- [2]
		},
		["快速治疗"] = {
			0, -- [1]
			"讲师玛丽希亚", -- [2]
		},
		["反手一击"] = {
			0, -- [1]
			"瑟尔林·卡斯迪诺夫教授", -- [2]
		},
		["嗜血"] = {
			663, -- [1]
			1, -- [2]
		},
		["火焰爆发"] = {
			0, -- [1]
			"伊森迪奥斯", -- [2]
		},
		["多彩混乱"] = {
			0, -- [1]
			"维克多·奈法里奥斯", -- [2]
		},
		["火息术"] = {
			0, -- [1]
			"弗拉斯·希亚比", -- [2]
		},
		["暗影迷雾"] = {
			0, -- [1]
			"阿雷克斯·巴罗夫", -- [2]
		},
		["末日降临"] = {
			663, -- [1]
			"鲁西弗隆", -- [2]
		},
		["割裂"] = {
			0, -- [1]
			"黑须的亲信", -- [2]
		},
		["冰链术"] = {
			0, -- [1]
			"艾德雷斯鬼怪", -- [2]
		},
		["投掷"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["女妖诅咒"] = {
			0, -- [1]
			"安娜丝塔丽男爵夫人", -- [2]
		},
		["召唤玩家"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["切割"] = {
			663, -- [1]
			4, -- [2]
		},
		["冰冻术"] = {
			0, -- [1]
			"盖斯", -- [2]
		},
		["射击"] = {
			0, -- [1]
			"炮手威利", -- [2]
		},
		["霜寒刺骨"] = {
			0, -- [1]
			8, -- [2]
		},
		["连发寒冰箭"] = {
			0, -- [1]
			"莱斯·霜语", -- [2]
		},
		["冰霜新星"] = {
			0, -- [1]
			"典狱官斯迪尔基斯", -- [2]
		},
		["点燃法力"] = {
			668, -- [1]
			"迦顿男爵", -- [2]
		},
		["深冬之寒"] = {
			0, -- [1]
			8, -- [2]
		},
		["火焰之雨"] = {
			665, -- [1]
			"基赫纳斯", -- [2]
		},
		["献祭陷阱"] = {
			0, -- [1]
			"伊琳娜·暗木", -- [2]
		},
		["灵感"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["寒冰之墓"] = {
			0, -- [1]
			"苍白的玛勒基", -- [2]
		},
		["神圣打击"] = {
			0, -- [1]
			"弗诺斯·达克维尔", -- [2]
		},
		["熔岩喷吐"] = {
			664, -- [1]
			"玛格曼达", -- [2]
		},
		["地狱火"] = {
			668, -- [1]
			"迦顿男爵", -- [2]
		},
		["击昏"] = {
			0, -- [1]
			"吞咽者拉姆斯登", -- [2]
		},
		["喷酒"] = {
			0, -- [1]
			"践踏者克雷格", -- [2]
		},
		["血之诅咒"] = {
			0, -- [1]
			"维雷克", -- [2]
		},
		["统御意志"] = {
			0, -- [1]
			"伊露希亚·巴罗夫", -- [2]
		},
		["挫志怒吼"] = {
			0, -- [1]
			"石翼尖啸者", -- [2]
		},
		["冲击波"] = {
			671, -- [1]
			"烈焰行者精英", -- [2]
		},
		["痛击"] = {
			0, -- [1]
			"悲惨的提米", -- [2]
		},
		["感染撕咬"] = {
			0, -- [1]
			"奴役者基兹鲁尔", -- [2]
		},
		["星辰碎片"] = {
			0, -- [1]
			"艾德雷斯巫师", -- [2]
		},
		["熔岩镣铐"] = {
			666, -- [1]
			"加尔", -- [2]
		},
		["熔岩爆裂"] = {
			0, -- [1]
			"控火师罗格雷恩", -- [2]
		},
		["狂怒"] = {
			0, -- [1]
			"悲惨的提米", -- [2]
		},
		["吸取生命"] = {
			0, -- [1]
			9, -- [2]
		},
		["污染光环"] = {
			0, -- [1]
			"马杜克·布莱克波尔", -- [2]
		},
		["烈焰火炮"] = {
			0, -- [1]
			"怒锤傀儡", -- [2]
		},
		["拉格纳罗斯之手"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["寒冰护体"] = {
			0, -- [1]
			8, -- [2]
		},
		["破胆咆哮"] = {
			0, -- [1]
			"乌洛克", -- [2]
		},
		["圆弧斩"] = {
			0, -- [1]
			"复活的构造体", -- [2]
		},
		["死亡缠绕"] = {
			0, -- [1]
			9, -- [2]
		},
		["拉格纳罗斯之怒"] = {
			0, -- [1]
			"暮光使者", -- [2]
		},
		["震击"] = {
			0, -- [1]
			"傀儡统帅阿格曼奇", -- [2]
		},
		["狂暴怒火"] = {
			0, -- [1]
			"巴瑟拉斯镇长", -- [2]
		},
		["燃烧"] = {
			664, -- [1]
			"熔岩炸弹", -- [2]
		},
		["低沉咆哮"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["缩小"] = {
			0, -- [1]
			"复活的守护者", -- [2]
		},
		["飞扑"] = {
			0, -- [1]
			"传令官基尔图诺斯", -- [2]
		},
		["火球术"] = {
			671, -- [1]
			"烈焰行者精英", -- [2]
		},
		["盾牌格挡"] = {
			0, -- [1]
			"铁怒卫士", -- [2]
		},
		["烈焰震击"] = {
			0, -- [1]
			"控火师罗格雷恩", -- [2]
		},
		["狂暴冲锋"] = {
			0, -- [1]
			"戈多克大王", -- [2]
		},
		["震荡射击"] = {
			0, -- [1]
			"伊琳娜·暗木", -- [2]
		},
		["魔爆术"] = {
			0, -- [1]
			"骷髅守护者", -- [2]
		},
		["脚踢"] = {
			0, -- [1]
			"弗诺斯·达克维尔", -- [2]
		},
		["恐慌"] = {
			664, -- [1]
			"玛格曼达", -- [2]
		},
		["疾病爆发"] = {
			0, -- [1]
			"虚弱的尸体", -- [2]
		},
		["剑刃乱舞"] = {
			663, -- [1]
			4, -- [2]
		},
		["暗影箭"] = {
			0, -- [1]
			"瑞文戴尔男爵", -- [2]
		},
		["强化震荡射击"] = {
			0, -- [1]
			"伊琳娜·暗木", -- [2]
		},
		["嗜血术"] = {
			0, -- [1]
			"尖石食人魔法师", -- [2]
		},
		["召唤幻象"] = {
			0, -- [1]
			"詹迪斯·巴罗夫", -- [2]
		},
		["麻痹之毒"] = {
			0, -- [1]
			"爬行者赫杜姆", -- [2]
		},
		["地震术"] = {
			0, -- [1]
			"洛考尔", -- [2]
		},
		["恐怖低吼"] = {
			0, -- [1]
			"血犬", -- [2]
		},
		["暗影之门"] = {
			0, -- [1]
			"黑暗院长加丁", -- [2]
		},
		["黑暗主宰诅咒"] = {
			0, -- [1]
			"黑暗院长加丁", -- [2]
		},
		["结晶"] = {
			0, -- [1]
			"烟网蛛后", -- [2]
		},
		["覆体之网"] = {
			0, -- [1]
			"奈鲁布恩坎", -- [2]
		},
		["致死顺劈"] = {
			0, -- [1]
			"克罗卡斯", -- [2]
		},
		["白骨熔化"] = {
			0, -- [1]
			"红衣铸锤师", -- [2]
		},
		["反魔法盾"] = {
			0, -- [1]
			"哀嚎的女妖", -- [2]
		},
		["放逐术"] = {
			0, -- [1]
			"詹迪斯·巴罗夫", -- [2]
		},
		["反击风暴"] = {
			0, -- [1]
			"克罗卡斯", -- [2]
		},
		["精神鞭笞"] = {
			0, -- [1]
			"卡雷迪斯镇长", -- [2]
		},
		["吞噬暗影"] = {
			0, -- [1]
			"复活的骷髅守卫", -- [2]
		},
		["冰冻新星"] = {
			0, -- [1]
			"莱斯·霜语", -- [2]
		},
		["破甲攻击"] = {
			0, -- [1]
			"安格弗将军", -- [2]
		},
		["恐吓嚎叫"] = {
			0, -- [1]
			"石翼尖啸者", -- [2]
		},
		["毁坏之痛"] = {
			0, -- [1]
			"暮光之锤拷问者", -- [2]
		},
		["变形术"] = {
			0, -- [1]
			"艾德雷斯巫师", -- [2]
		},
		["裂颅"] = {
			0, -- [1]
			"狂热的玛洛尔", -- [2]
		},
		["闪电链"] = {
			0, -- [1]
			"傀儡统帅阿格曼奇", -- [2]
		},
		["恶毒撕裂"] = {
			0, -- [1]
			"石脊", -- [2]
		},
		["破甲顺劈"] = {
			0, -- [1]
			"拉文尼亚", -- [2]
		},
		["腐蚀术"] = {
			0, -- [1]
			"讲师玛丽希亚", -- [2]
		},
		["地穴甲虫"] = {
			0, -- [1]
			"奈鲁布恩坎", -- [2]
		},
		["黑暗瘟疫"] = {
			0, -- [1]
			"复生的尸体", -- [2]
		},
		["烟雾弹"] = {
			0, -- [1]
			"弗拉斯·希亚比", -- [2]
		},
		["火焰冲击"] = {
			0, -- [1]
			8, -- [2]
		},
		["毒药"] = {
			0, -- [1]
			"亡灵甲虫 <奈鲁布恩坎>", -- [2]
		},
		["复活亡灵甲虫"] = {
			0, -- [1]
			"奈鲁布恩坎", -- [2]
		},
		["掷斧"] = {
			0, -- [1]
			"指挥官沃恩", -- [2]
		},
		["食尸鬼瘟疫"] = {
			0, -- [1]
			"恶疫食尸鬼", -- [2]
		},
		["旋风斩"] = {
			0, -- [1]
			"大酋长雷德·黑手 <盖斯>", -- [2]
		},
		["末日决战"] = {
			668, -- [1]
			"迦顿男爵", -- [2]
		},
		["伊莫塔尔之眼"] = {
			0, -- [1]
			"伊莫塔尔", -- [2]
		},
		["喝下治疗药水"] = {
			0, -- [1]
			"卫兵杜格瑞普", -- [2]
		},
		["拉格纳罗斯之拳"] = {
			665, -- [1]
			"烈焰行者", -- [2]
		},
		["裂筋"] = {
			0, -- [1]
			"戈多克驯狼", -- [2]
		},
		["恐惧术"] = {
			0, -- [1]
			"莱斯·霜语", -- [2]
		},
		["拍翼"] = {
			0, -- [1]
			"传令官基尔图诺斯", -- [2]
		},
		["尖牙撕咬"] = {
			663, -- [1]
			"熔火恶犬", -- [2]
		},
		["生命虹吸"] = {
			0, -- [1]
			9, -- [2]
		},
		["盾击"] = {
			0, -- [1]
			"铁怒狱卒", -- [2]
		},
		["活化炸弹"] = {
			668, -- [1]
			"迦顿男爵", -- [2]
		},
		["炸弹"] = {
			0, -- [1]
			"厄炉工匠", -- [2]
		},
		["击退"] = {
			0, -- [1]
			"炮手威利", -- [2]
		},
		["法力燃烧"] = {
			0, -- [1]
			"审讯官格斯塔恩", -- [2]
		},
		["战斗怒吼"] = {
			0, -- [1]
			"铁怒预备兵", -- [2]
		},
		["召唤雷德·黑手"] = {
			0, -- [1]
			"盖斯", -- [2]
		},
		["驱散魔法"] = {
			0, -- [1]
			"燃棘暗影牧师", -- [2]
		},
		["践踏"] = {
			0, -- [1]
			"吞咽者拉姆斯登", -- [2]
		},
		["召唤尖塔小蜘蛛"] = {
			0, -- [1]
			"烟网蛛后", -- [2]
		},
		["大地震颤"] = {
			0, -- [1]
			"洛考尔", -- [2]
		},
		["盾牌猛击"] = {
			0, -- [1]
			"复活的卫兵", -- [2]
		},
		["Enrage Trigger"] = {
			666, -- [1]
			"火誓者", -- [2]
		},
		["暗言术：痛"] = {
			0, -- [1]
			"审讯官格斯塔恩", -- [2]
		},
		["群体打击"] = {
			0, -- [1]
			"巴瑟拉斯镇长", -- [2]
		},
		["反魔法脉冲"] = {
			666, -- [1]
			"加尔", -- [2]
		},
		["横扫攻击"] = {
			0, -- [1]
			"复活的构造体", -- [2]
		},
		["撕裂"] = {
			0, -- [1]
			"安娜丝塔丽男爵夫人", -- [2]
		},
		["残废术"] = {
			0, -- [1]
			"复活的守护者", -- [2]
		},
		["神圣力量"] = {
			0, -- [1]
			4, -- [2]
		},
		["鲁西弗隆的诅咒"] = {
			663, -- [1]
			"鲁西弗隆", -- [2]
		},
		["疾病之云"] = {
			0, -- [1]
			"生病的食尸鬼", -- [2]
		},
		["基尔图诺斯变形"] = {
			0, -- [1]
			"传令官基尔图诺斯", -- [2]
		},
		["熔岩喷溅"] = {
			670, -- [1]
			"焚化者古雷曼格", -- [2]
		},
		["刺穿护甲"] = {
			0, -- [1]
			"奈鲁布恩坎", -- [2]
		},
		["暗影屏障"] = {
			0, -- [1]
			"红衣审查者", -- [2]
		},
		["烈焰之矛"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["蛛后的乳汁"] = {
			0, -- [1]
			"烟网蛛后", -- [2]
		},
		["传送"] = {
			671, -- [1]
			"管理者埃克索图斯", -- [2]
		},
		["刺骨"] = {
			0, -- [1]
			"雷布里的亲信", -- [2]
		},
		["槌击"] = {
			0, -- [1]
			"费拉", -- [2]
		},
		["元素火焰"] = {
			672, -- [1]
			"拉格纳罗斯", -- [2]
		},
		["女妖哀嚎"] = {
			0, -- [1]
			"安娜丝塔丽男爵夫人", -- [2]
		},
		["杀死乌洛克的爪牙"] = {
			0, -- [1]
			"Challenge to Urok Trap", -- [2]
		},
		["熔岩吐息"] = {
			664, -- [1]
			"玛格曼达", -- [2]
		},
		["伤害反射护盾"] = {
			671, -- [1]
			"烈焰行者精英", -- [2]
		},
		["心灵震爆"] = {
			0, -- [1]
			"铁怒医师", -- [2]
		},
		["祸害之毒"] = {
			0, -- [1]
			"爬行者赫杜姆", -- [2]
		},
		["心灵尖啸"] = {
			0, -- [1]
			"观察者克鲁什", -- [2]
		},
		["暗影震击"] = {
			0, -- [1]
			"伊露希亚·巴罗夫", -- [2]
		},
		["燃烧之风"] = {
			0, -- [1]
			"档案管理员加尔福特", -- [2]
		},
		["炮火"] = {
			0, -- [1]
			"炮弹", -- [2]
		},
		["岩浆喷溅"] = {
			0, -- [1]
			"贝尔加", -- [2]
		},
		["火焰新星"] = {
			0, -- [1]
			"档案管理员加尔福特", -- [2]
		},
		["石像鬼打击"] = {
			0, -- [1]
			"石翼尖啸者", -- [2]
		},
		["凿击"] = {
			0, -- [1]
			"雷布里·斯库比格特", -- [2]
		},
		["落雷之云"] = {
			0, -- [1]
			"奥术洪流", -- [2]
		},
		["衰减魔法"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["沙斯拉尔之门"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["召唤法力脉冲"] = {
			0, -- [1]
			"畸形残渣", -- [2]
		},
		["困兽之爪"] = {
			0, -- [1]
			"悲惨的提米", -- [2]
		},
		["魔法反射"] = {
			671, -- [1]
			"管理者埃克索图斯", -- [2]
		},
		["邪恶光环"] = {
			0, -- [1]
			"瑞文戴尔男爵", -- [2]
		},
		["致死打击"] = {
			0, -- [1]
			"瑞文戴尔男爵", -- [2]
		},
		["断筋"] = {
			0, -- [1]
			"骷髅狂战士", -- [2]
		},
		["颅骨爆裂"] = {
			0, -- [1]
			"战斗傀儡", -- [2]
		},
		["炎爆术"] = {
			0, -- [1]
			"档案管理员加尔福特", -- [2]
		},
		["抵抗火焰"] = {
			0, -- [1]
			"裂盾缚法师", -- [2]
		},
		["惩击"] = {
			0, -- [1]
			5, -- [2]
		},
		["猛踢"] = {
			0, -- [1]
			"指挥官沃恩", -- [2]
		},
		["基赫纳斯的诅咒"] = {
			665, -- [1]
			"基赫纳斯", -- [2]
		},
		["黑暗打击"] = {
			669, -- [1]
			"烈焰行者祭司", -- [2]
		},
		["防护火焰结界"] = {
			0, -- [1]
			"控火师罗格雷恩", -- [2]
		},
		["痛苦诅咒"] = {
			0, -- [1]
			"伊露希亚·巴罗夫", -- [2]
		},
		["冰霜震击"] = {
			0, -- [1]
			"复仇的幻影", -- [2]
		},
		["火焰风暴"] = {
			0, -- [1]
			"伊森迪奥斯", -- [2]
		},
		["上钩拳"] = {
			0, -- [1]
			"怒锤傀儡", -- [2]
		},
		["召唤贝尔加的产物"] = {
			0, -- [1]
			"贝尔加", -- [2]
		},
		["熔岩冲击"] = {
			0, -- [1]
			"拉格纳罗斯", -- [2]
		},
		["清算圣印"] = {
			0, -- [1]
			"弗诺斯·达克维尔", -- [2]
		},
		["拳击"] = {
			0, -- [1]
			"炮手威利", -- [2]
		},
		["破胆怒吼"] = {
			0, -- [1]
			"克罗卡斯", -- [2]
		},
		["全力一击"] = {
			0, -- [1]
			"巴瑟拉斯镇长", -- [2]
		},
		["暗影之盾"] = {
			0, -- [1]
			"审讯官格斯塔恩", -- [2]
		},
		["蛛网爆炸"] = {
			0, -- [1]
			"爬行者赫杜姆", -- [2]
		},
		["愤怒"] = {
			0, -- [1]
			11, -- [2]
		},
		["催眠曲"] = {
			0, -- [1]
			"弗雷斯特恩", -- [2]
		},
		["腐蚀酸液"] = {
			0, -- [1]
			"博学者普克尔特", -- [2]
		},
		["暗影箭雨"] = {
			0, -- [1]
			"传令官基尔图诺斯", -- [2]
		},
		["纠缠根须"] = {
			0, -- [1]
			"埃隆巴克保护者", -- [2]
		},
		["大地粉碎"] = {
			0, -- [1]
			"狂热的玛洛尔", -- [2]
		},
		["龙翼攻击"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["迅捷治愈"] = {
			0, -- [1]
			11, -- [2]
		},
		["打击"] = {
			0, -- [1]
			"骷髅狂战士", -- [2]
		},
		["霜甲术"] = {
			0, -- [1]
			"莱斯·霜语", -- [2]
		},
		["醉酒怒气"] = {
			0, -- [1]
			"霍尔雷·黑须", -- [2]
		},
		["妖术"] = {
			0, -- [1]
			"暗影猎手沃什加斯", -- [2]
		},
		["缠绕之藤"] = {
			0, -- [1]
			"特迪斯·扭木", -- [2]
		},
		["吸取法力"] = {
			0, -- [1]
			"苍白的玛勒基", -- [2]
		},
		["虔诚光环"] = {
			0, -- [1]
			"弗诺斯·达克维尔", -- [2]
		},
		["盾牌冲锋"] = {
			0, -- [1]
			"卫兵摩尔达", -- [2]
		},
		["女妖尖叫"] = {
			0, -- [1]
			"艾德雷斯鬼巫", -- [2]
		},
		["暗影形态"] = {
			0, -- [1]
			"卡雷迪斯镇长", -- [2]
		},
		["冲锋"] = {
			0, -- [1]
			"费拉", -- [2]
		},
		["腐蚀酸液吐息"] = {
			0, -- [1]
			"盖斯", -- [2]
		},
		["圣光术"] = {
			0, -- [1]
			"弗诺斯·达克维尔", -- [2]
		},
		["纠缠"] = {
			0, -- [1]
			"特迪斯·扭木", -- [2]
		},
		["昏迷炸弹"] = {
			0, -- [1]
			"军需官兹格雷斯", -- [2]
		},
		["熔岩之盾"] = {
			672, -- [1]
			"烈焰之子", -- [2]
		},
		["沙斯拉尔的诅咒"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["扭曲"] = {
			0, -- [1]
			"厄炉工匠", -- [2]
		},
		["吐息"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["献祭"] = {
			0, -- [1]
			"阿雷克斯·巴罗夫", -- [2]
		},
		["生命分流"] = {
			0, -- [1]
			9, -- [2]
		},
		["语言诅咒"] = {
			0, -- [1]
			"传令官基尔图诺斯", -- [2]
		},
		["治疗之触"] = {
			0, -- [1]
			11, -- [2]
		},
		["多重射击"] = {
			0, -- [1]
			"伊琳娜·暗木", -- [2]
		},
		["毒害之灾"] = {
			0, -- [1]
			"博学者普克尔特", -- [2]
		},
		["自杀"] = {
			0, -- [1]
			"阿莎利水晶", -- [2]
		},
		["横扫猛击"] = {
			0, -- [1]
			"维姆萨拉克", -- [2]
		},
		["快速传染"] = {
			0, -- [1]
			"博学者普克尔特", -- [2]
		},
		["烈焰风暴"] = {
			0, -- [1]
			"维克图斯", -- [2]
		},
		["冰锥术"] = {
			0, -- [1]
			"骷髅守护者", -- [2]
		},
		["火焰之盾"] = {
			0, -- [1]
			"帕格匹特 <Edge>", -- [2]
		},
		["奥术冲击"] = {
			0, -- [1]
			"畸形残渣", -- [2]
		},
		["乱射"] = {
			0, -- [1]
			"伊琳娜·暗木", -- [2]
		},
		["狂乱"] = {
			664, -- [1]
			"玛格曼达", -- [2]
		},
		["恶性毒药"] = {
			0, -- [1]
			"地穴兽", -- [2]
		},
		["献祭陷阱效果"] = {
			0, -- [1]
			"伊琳娜·暗木", -- [2]
		},
		["凝视"] = {
			0, -- [1]
			"复活的畸形骷髅", -- [2]
		},
		["龙尾扫击"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["破碎一击"] = {
			0, -- [1]
			"戈多克蛮兵", -- [2]
		},
		["元素领主的诅咒"] = {
			0, -- [1]
			"伊森迪奥斯", -- [2]
		},
		["战争践踏"] = {
			0, -- [1]
			"血骨傀儡", -- [2]
		},
		["割碎"] = {
			670, -- [1]
			"熔火怒犬", -- [2]
		},
		["减速术"] = {
			0, -- [1]
			"讲师玛丽希亚", -- [2]
		},
		["治疗祷言"] = {
			0, -- [1]
			"铁怒医师", -- [2]
		},
		["特效治疗石"] = {
			0, -- [1]
			11, -- [2]
		},
		["奥术箭"] = {
			0, -- [1]
			"尖石食人魔法师", -- [2]
		},
		["冰冻"] = {
			0, -- [1]
			"苍白的玛勒基", -- [2]
		},
		["钩网"] = {
			0, -- [1]
			"铁怒狱卒", -- [2]
		},
		["奥术飞弹"] = {
			0, -- [1]
			"黑暗院长加丁", -- [2]
		},
		["旋风斩效果"] = {
			0, -- [1]
			"大酋长雷德·黑手 <盖斯>", -- [2]
		},
		["吸血一击"] = {
			0, -- [1]
			"巴瑟拉斯镇长", -- [2]
		},
		["闪电之盾"] = {
			0, -- [1]
			"傀儡统帅阿格曼奇", -- [2]
		},
		["灵魂撕裂"] = {
			0, -- [1]
			"艾德雷斯鬼巫", -- [2]
		},
		["沉默"] = {
			0, -- [1]
			"安娜丝塔丽男爵夫人", -- [2]
		},
		["爆发"] = {
			666, -- [1]
			"火誓者", -- [2]
		},
		["刺破"] = {
			0, -- [1]
			"乌洛克惩戒者", -- [2]
		},
		["无情打击效果"] = {
			0, -- [1]
			4, -- [2]
		},
		["炽热之地"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["顺劈斩"] = {
			0, -- [1]
			"瑞文戴尔男爵", -- [2]
		},
		["!Melee"] = {
			0, -- [1]
			"石翼尖啸者", -- [2]
		},
		["缴械"] = {
			0, -- [1]
			"铁怒卫士", -- [2]
		},
		["黑暗治疗"] = {
			669, -- [1]
			"烈焰行者祭司", -- [2]
		},
		["致命毒药 IV"] = {
			0, -- [1]
			"伊露希亚·巴罗夫", -- [2]
		},
		["火焰的召唤"] = {
			0, -- [1]
			"讲师玛丽希亚", -- [2]
		},
		["死尸虫"] = {
			0, -- [1]
			"被撕裂的死尸", -- [2]
		},
	},
	["dungeon_data"] = {
	},
	["got_first_run"] = true,
	["report_pos"] = {
		1, -- [1]
		1.00003051757813, -- [2]
	},
	["latest_report_table"] = {
		{
			2, -- [1]
			1, -- [2]
			3, -- [3]
			5, -- [4]
			"GUILD", -- [5]
		}, -- [1]
		{
			1, -- [1]
			1, -- [2]
			1, -- [3]
			15, -- [4]
			"GUILD", -- [5]
		}, -- [2]
		{
			1, -- [1]
			1, -- [2]
			3, -- [3]
			5, -- [4]
			"PARTY", -- [5]
		}, -- [3]
		{
			2, -- [1]
			1, -- [2]
			3, -- [3]
			5, -- [4]
			"PARTY", -- [5]
		}, -- [4]
		{
			2, -- [1]
			1, -- [2]
			1, -- [3]
			5, -- [4]
			"GUILD", -- [5]
		}, -- [5]
		{
			1, -- [1]
			1, -- [2]
			1, -- [3]
			5, -- [4]
			"PARTY", -- [5]
		}, -- [6]
	},
	["__profiles"] = {
		["Devops-碧玉矿洞"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["maximize_method"] = 1,
				["fontshadow"] = false,
				["border_size"] = 14,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["instances_segments_locked"] = false,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["deadlog_limit"] = 16,
			["instances_no_libwindow"] = false,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["clear_ungrouped"] = true,
			["data_broker_text"] = "",
			["segments_amount"] = 18,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = 129.943634033203,
							["x"] = 667.951171875,
							["w"] = 310.000335693359,
							["h"] = 158.000366210938,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["height"] = 20,
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["texture_custom_file"] = "Interface\\",
						["font_size"] = 12,
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["use_spec_icons"] = false,
						["texture_custom"] = "",
						["texture"] = "BantoBar",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_enable_custom_text"] = false,
						["textL_outline_small"] = true,
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["textR_enable_custom_text"] = false,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_background"] = "Details D'ictum (reverse)",
						["alpha"] = 1,
						["textR_class_colors"] = false,
						["textL_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_outline_small"] = true,
						["font_face"] = "默认",
						["texture_class_colors"] = true,
						["start_after_icon"] = true,
						["fast_ps_update"] = false,
						["textR_separator"] = ",",
						["textR_bracket"] = "(",
					},
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["timeType"] = 1,
								["textXMod"] = 6,
								["textAlign"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["switch_tank_in_combat"] = false,
					["bg_alpha"] = 0.183960914611816,
					["__snapV"] = true,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["__snapH"] = false,
					["show_statusbar"] = false,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
						[2] = 2,
					},
					["backdrop_texture"] = "Details Ground",
					["hide_in_combat_alpha"] = 0,
					["clickthrough_rows"] = false,
					["bars_inverted"] = false,
					["libwindow"] = {
						["y"] = 129.943634033203,
						["x"] = -30.382080078125,
						["point"] = "RIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["switch_damager_in_combat"] = false,
					["bars_grow_direction"] = 1,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["bars_sort_direction"] = 1,
					["menu_icons_size"] = 0.850000023841858,
					["grab_on_top"] = false,
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["auto_current"] = true,
					["version"] = 3,
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["enable_custom_text"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
					},
					["desaturated_menu"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = 129.943634033203,
							["x"] = 667.951171875,
							["w"] = 310.000335693359,
							["h"] = 158.000366210938,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["switch_tank"] = false,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["switch_all_roles_after_wipe"] = false,
					["show_sidebars"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["skin_custom"] = "",
				}, -- [1]
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -48.0566711425781,
							["x"] = 667.951171875,
							["w"] = 310.00048828125,
							["h"] = 158.000335693359,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textL_outline_small"] = true,
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["textR_bracket"] = "(",
						["font_size"] = 12,
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
						["use_spec_icons"] = false,
						["textR_enable_custom_text"] = false,
						["texture"] = "BantoBar",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_enable_custom_text"] = false,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["textR_outline_small"] = true,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textR_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textL_class_colors"] = false,
						["texture_background"] = "Details D'ictum (reverse)",
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["texture_custom"] = "",
						["font_face"] = "默认",
						["texture_class_colors"] = true,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = ",",
						["height"] = 20,
					},
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["enabled"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textStyle"] = 2,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textXMod"] = 6,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["switch_tank_in_combat"] = false,
					["bg_alpha"] = 0.183960914611816,
					["__snapV"] = true,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["__snapH"] = false,
					["show_statusbar"] = false,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
						[4] = 1,
						[2] = 3,
					},
					["backdrop_texture"] = "Details Ground",
					["hide_in_combat_alpha"] = 0,
					["clickthrough_rows"] = false,
					["bars_inverted"] = false,
					["libwindow"] = {
						["y"] = -48.0566864013672,
						["x"] = -30.3819580078125,
						["point"] = "RIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["switch_damager_in_combat"] = false,
					["bars_grow_direction"] = 1,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["bars_sort_direction"] = 1,
					["menu_icons_size"] = 0.850000023841858,
					["grab_on_top"] = false,
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["auto_current"] = true,
					["version"] = 3,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["enable_custom_text"] = false,
						["enabled"] = true,
					},
					["desaturated_menu"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -48.0566711425781,
							["x"] = 667.951171875,
							["w"] = 310.00048828125,
							["h"] = 158.000335693359,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["switch_tank"] = false,
					["wallpaper"] = {
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["enabled"] = false,
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["switch_all_roles_after_wipe"] = false,
					["show_sidebars"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["skin_custom"] = "",
				}, -- [2]
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -226.056854248047,
							["x"] = 667.951171875,
							["w"] = 310.000335693359,
							["h"] = 158.000015258789,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textL_outline_small"] = true,
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["font_size"] = 12,
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["textR_bracket"] = "(",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
						["use_spec_icons"] = false,
						["textR_enable_custom_text"] = false,
						["texture"] = "BantoBar",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_enable_custom_text"] = false,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["textR_outline_small"] = true,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textR_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textL_class_colors"] = false,
						["texture_background"] = "Details D'ictum (reverse)",
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["texture_custom"] = "",
						["font_face"] = "默认",
						["texture_class_colors"] = true,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = ",",
						["height"] = 20,
					},
					["switch_tank"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["enabled"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["timeType"] = 1,
								["textXMod"] = 6,
								["textAlign"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["switch_tank_in_combat"] = false,
					["bg_alpha"] = 0.183960914611816,
					["__snapV"] = true,
					["__locked"] = true,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["show_statusbar"] = false,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
						[4] = 2,
					},
					["menu_icons_size"] = 0.850000023841858,
					["hide_in_combat_alpha"] = 0,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["bars_inverted"] = false,
					["libwindow"] = {
						["y"] = 174.943161010742,
						["x"] = -30.382080078125,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["switch_damager_in_combat"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["bars_sort_direction"] = 1,
					["grab_on_top"] = false,
					["backdrop_texture"] = "Details Ground",
					["clickthrough_rows"] = false,
					["auto_current"] = true,
					["version"] = 3,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["enable_custom_text"] = false,
						["enabled"] = true,
					},
					["desaturated_menu"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -226.056854248047,
							["x"] = 667.951171875,
							["w"] = 310.000335693359,
							["h"] = 158.000015258789,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["ignore_mass_showhide"] = false,
					["wallpaper"] = {
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["enabled"] = false,
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["switch_all_roles_after_wipe"] = false,
					["show_sidebars"] = false,
					["bars_grow_direction"] = 1,
					["skin_custom"] = "",
				}, -- [3]
			},
			["report_lines"] = 5,
			["use_battleground_server_parser"] = false,
			["use_scroll"] = false,
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["report_schema"] = 1,
			["overall_clear_newboss"] = true,
			["minimum_combat_time"] = 5,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["overall_clear_logout"] = false,
			["memory_threshold"] = 3,
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["standard_skin"] = false,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["trash_auto_remove"] = true,
			["animation_speed_triggertravel"] = 5,
			["clear_graphic"] = true,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["default_bg_color"] = 0.0941,
			["segments_amount_to_save"] = 18,
			["total_abbreviation"] = 2,
			["segments_panic_mode"] = false,
			["numerical_system_symbols"] = "auto",
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["font_sizes"] = {
				["menus"] = 10,
			},
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["numerical_system"] = 2,
			["force_activity_time_pvp"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["pvp_as_group"] = true,
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["time_type_original"] = 2,
		},
		["Ansible-碧玉矿洞"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["fontshadow"] = false,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["border_size"] = 14,
				["maximize_method"] = 1,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["instances_segments_locked"] = false,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["deadlog_limit"] = 16,
			["instances_no_libwindow"] = false,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["clear_ungrouped"] = true,
			["data_broker_text"] = "",
			["segments_amount"] = 18,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -3.05175781250e-05,
							["x"] = 0,
							["w"] = 310.000030517578,
							["h"] = 157.999954223633,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["menu_icons_size"] = 0.850000023841858,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["font_size"] = 16,
						["height"] = 21,
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textR_bracket"] = "(",
						["use_spec_icons"] = true,
						["texture_custom"] = "",
						["texture_custom_file"] = "Interface\\",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textR_enable_custom_text"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textR_class_colors"] = false,
						["alpha"] = 1,
						["textL_class_colors"] = false,
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["percent_type"] = 1,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
					},
					["switch_tank"] = false,
					["switch_all_roles_after_wipe"] = false,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bars_inverted"] = false,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textStyle"] = 2,
								["textXMod"] = 6,
								["timeType"] = 1,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["show_statusbar"] = false,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["clickthrough_window"] = false,
					["hide_in_combat_alpha"] = 0,
					["skin_custom"] = "",
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["libwindow"] = {
						["y"] = 1.525878906250e-05,
						["x"] = 0,
						["point"] = "CENTER",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["bars_grow_direction"] = 1,
					["plugins_grow_direction"] = 1,
					["desaturated_menu"] = false,
					["switch_damager_in_combat"] = false,
					["grab_on_top"] = false,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["backdrop_texture"] = "Details Ground",
					["auto_current"] = true,
					["version"] = 3,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["enabled"] = true,
						["enable_custom_text"] = false,
						["text_size"] = 12,
					},
					["switch_tank_in_combat"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -3.05175781250e-05,
							["x"] = 0,
							["w"] = 310.000030517578,
							["h"] = 157.999954223633,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["ignore_mass_showhide"] = false,
					["micro_displays_side"] = 2,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["show_sidebars"] = false,
					["bg_b"] = 0.0941176470588235,
					["clickthrough_rows"] = false,
					["bars_sort_direction"] = 1,
				}, -- [1]
			},
			["report_lines"] = 5,
			["use_battleground_server_parser"] = false,
			["use_scroll"] = false,
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["report_schema"] = 1,
			["overall_clear_newboss"] = true,
			["minimum_combat_time"] = 5,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["overall_clear_logout"] = false,
			["memory_threshold"] = 3,
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["standard_skin"] = false,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["trash_auto_remove"] = true,
			["animation_speed_triggertravel"] = 5,
			["clear_graphic"] = true,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["default_bg_color"] = 0.0941,
			["segments_amount_to_save"] = 18,
			["total_abbreviation"] = 2,
			["segments_panic_mode"] = false,
			["numerical_system_symbols"] = "auto",
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["pvp_as_group"] = true,
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["time_type_original"] = 2,
		},
	},
	["boss_mods_timers"] = {
		["encounter_timers_bw"] = {
		},
		["encounter_timers_dbm"] = {
			["19703"] = {
				"19703", -- [1]
				"Timer19703cd", -- [2]
				"鲁西弗隆的诅咒冷却", -- [3]
				12, -- [4]
				136123, -- [5]
				"cd", -- [6]
				19703, -- [7]
				3, -- [8]
				"Lucifron", -- [9]
				["id"] = 663,
			},
			["18584"] = {
				"18584", -- [1]
				"Timer18584cast", -- [2]
				"吐息", -- [3]
				5, -- [4]
				135805, -- [5]
				"cast", -- [6]
				18584, -- [7]
				3, -- [8]
				"Onyxia", -- [9]
				["id"] = 1084,
			},
			["19716"] = {
				"19716", -- [1]
				"Timer19716cd", -- [2]
				"基赫纳斯的诅咒冷却", -- [3]
				6, -- [4]
				136160, -- [5]
				"cd", -- [6]
				19716, -- [7]
				3, -- [8]
				"Gehennas", -- [9]
				["id"] = 665,
			},
			["20475"] = {
				"20475", -- [1]
				"Timer20475cd", -- [2]
				"活化炸弹冷却", -- [3]
				11, -- [4]
				132863, -- [5]
				"cd", -- [6]
				20475, -- [7]
				3, -- [8]
				"Geddon", -- [9]
				["id"] = 668,
			},
			["19702"] = {
				"19702", -- [1]
				"Timer19702cd", -- [2]
				"末日降临冷却", -- [3]
				7, -- [4]
				136179, -- [5]
				"cd", -- [6]
				19702, -- [7]
				3, -- [8]
				"Lucifron", -- [9]
				["id"] = 663,
			},
			["19713"] = {
				"19713", -- [1]
				"Timer19713cd", -- [2]
				"沙斯拉尔的诅咒冷却", -- [3]
				6, -- [4]
				136121, -- [5]
				"cd", -- [6]
				19713, -- [7]
				3, -- [8]
				"Shazzrah", -- [9]
				["id"] = 667,
			},
			["19451"] = {
				"19451", -- [1]
				"Timer19451active", -- [2]
				"狂乱结束", -- [3]
				8, -- [4]
				132117, -- [5]
				"active", -- [6]
				19451, -- [7]
				5, -- [8]
				"Magmadar", -- [9]
				["id"] = 664,
			},
			["20478"] = {
				"20478", -- [1]
				"Timer20478cast", -- [2]
				"末日决战", -- [3]
				8, -- [4]
				135826, -- [5]
				"cast", -- [6]
				20478, -- [7]
				2, -- [8]
				"Geddon", -- [9]
				["id"] = 668,
			},
			["20534"] = {
				"20534", -- [1]
				"Timer20534cd", -- [2]
				"传送冷却", -- [3]
				19.4, -- [4]
				135736, -- [5]
				"cd", -- [6]
				20534, -- [7]
				5, -- [8]
				"Majordomo", -- [9]
				["id"] = 671,
			},
			["19695"] = {
				"19695", -- [1]
				"Timer19695active", -- [2]
				"地狱火结束", -- [3]
				8, -- [4]
				135818, -- [5]
				"active", -- [6]
				19695, -- [7]
				2, -- [8]
				"Geddon", -- [9]
				["id"] = 668,
			},
			["20566"] = {
				"20566", -- [1]
				"Timer20566cd", -- [2]
				"拉格纳罗斯之怒冷却", -- [3]
				26.7, -- [4]
				135827, -- [5]
				"cd", -- [6]
				20566, -- [7]
				2, -- [8]
				"Ragnaros-Classic", -- [9]
				["id"] = 672,
			},
			["19408"] = {
				"19408", -- [1]
				"Timer19408cd", -- [2]
				"恐慌冷却", -- [3]
				30, -- [4]
				136147, -- [5]
				"cd", -- [6]
				19408, -- [7]
				2, -- [8]
				"Magmadar", -- [9]
				["id"] = 664,
			},
			["19659"] = {
				"19659", -- [1]
				"Timer19659cd", -- [2]
				"点燃法力冷却", -- [3]
				27, -- [4]
				135818, -- [5]
				"cd", -- [6]
				19659, -- [7]
				2, -- [8]
				"Geddon", -- [9]
				["id"] = 668,
			},
			["18435"] = {
				"18435", -- [1]
				"Timer18435cd2", -- [2]
				"火息术冷却", -- [3]
				13.3, -- [4]
				135805, -- [5]
				"cd", -- [6]
				18435, -- [7]
				5, -- [8]
				"Onyxia", -- [9]
				["id"] = 1084,
			},
			["20619"] = {
				"20619", -- [1]
				"Timer20619active", -- [2]
				"魔法反射结束", -- [3]
				10, -- [4]
				135849, -- [5]
				"active", -- [6]
				20619, -- [7]
				5, -- [8]
				"Majordomo", -- [9]
				["id"] = 671,
			},
			["21075"] = {
				"21075", -- [1]
				"Timer21075active", -- [2]
				"伤害反射护盾结束", -- [3]
				10, -- [4]
				136121, -- [5]
				"active", -- [6]
				21075, -- [7]
				5, -- [8]
				"Majordomo", -- [9]
				["id"] = 671,
			},
			["nil"] = {
				"nil", -- [1]
				"timerShieldCD", -- [2]
				"Next Shield", -- [3]
				27.8, -- [4]
				"136116", -- [5]
				nil, -- [6]
				nil, -- [7]
				6, -- [8]
				"Majordomo", -- [9]
				["id"] = 671,
			},
			["19775"] = {
				"19775", -- [1]
				"Timer19775cast2", -- [2]
				"黑暗治疗", -- [3]
				2, -- [4]
				136130, -- [5]
				"cast", -- [6]
				19775, -- [7]
				4, -- [8]
				"Sulfuron", -- [9]
				["id"] = 669,
			},
			["19492"] = {
				"19492", -- [1]
				"Timer19492cd", -- [2]
				"反魔法脉冲冷却", -- [3]
				10, -- [4]
				135894, -- [5]
				"cd", -- [6]
				19492, -- [7]
				2, -- [8]
				"Garr-Classic", -- [9]
				["id"] = 666,
			},
		},
	},
	["disable_talent_feature"] = false,
	["mobs_data"] = {
	},
	["deathlog_healingdone_min"] = 1,
	["plater"] = {
		["realtime_dps_enabled"] = false,
		["realtime_dps_size"] = 12,
		["realtime_dps_player_shadow"] = true,
		["damage_taken_enabled"] = false,
		["realtime_dps_player_size"] = 12,
		["damage_taken_size"] = 12,
		["realtime_dps_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_shadow"] = true,
		["damage_taken_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_enabled"] = false,
		["realtime_dps_shadow"] = true,
	},
	["always_use_profile"] = false,
	["spell_school_cache"] = {
		["割裂"] = 1,
		["毒药"] = 8,
		["闪电吐息"] = 8,
		["投掷"] = 1,
		["邪恶攻击"] = 1,
		["撕咬"] = 1,
		["多重射击"] = 1,
		["冰霜新星"] = 16,
		["打击"] = 1,
		["噬灵瘟疫"] = 32,
		["猛禽一击"] = 1,
		["生命虹吸"] = 32,
		["寒冰箭"] = 16,
		["撕裂"] = 1,
		["邪恶光环"] = 32,
		["寒冰爪"] = 16,
		["槌击"] = 1,
		["荆棘术"] = 8,
		["冰锥术"] = 16,
		["火球术"] = 4,
		["神圣之火"] = 2,
		["吸取灵魂"] = 32,
		["刺骨"] = 1,
		["射击"] = 1,
		["暗影箭"] = 32,
		["冰冻"] = 16,
		["痛苦诅咒"] = 32,
		["魔爆术"] = 64,
		["致伤"] = 1,
		["!Autoshot"] = 1,
		["瞄准射击"] = 1,
		["践踏"] = 1,
		["毒蛇钉刺"] = 8,
		["压制"] = 1,
		["重击"] = 1,
		["腐蚀术"] = 32,
		["暗言术：痛"] = 32,
		["投网"] = 1,
		["爪击"] = 1,
		["击倒"] = 1,
		["痛击"] = 1,
		["!Melee"] = 1,
		["精灵之火"] = 8,
		["熔化护甲"] = 4,
		["速效毒药 IV"] = 8,
		["致命毒药 III"] = 8,
		["火焰冲击"] = 4,
	},
	["run_code"] = {
		["on_specchanged"] = "\n-- run when the player changes its spec",
		["on_zonechanged"] = "\n-- when the player changes zone, this code will run",
		["on_init"] = "\n-- code to run when Details! initializes, put here code which only will run once\n-- this also will run then the profile is changed\n\n--size of the death log tooltip in the Deaths display (default 350)\nDetails.death_tooltip_width = 350;\n\n--when in arena or battleground, details! silently switch to activity time (goes back to the old setting on leaving, default true)\nDetails.force_activity_time_pvp = true;\n\n--speed of the bar animations (default 33)\nDetails.animation_speed = 33;\n\n--threshold to trigger slow or fast speed (default 0.45)\nDetails.animation_speed_mintravel = 0.45;\n\n--call to update animations\nDetails:RefreshAnimationFunctions();\n\n--max window size, does require a /reload to work (default 480 x 450)\nDetails.max_window_size.width = 480;\nDetails.max_window_size.height = 450;\n\n--use the arena team color as the class color (default true)\nDetails.color_by_arena_team = true;\n\n--use the role icon in the player bar when inside an arena (default false)\nDetails.show_arena_role_icon = false;\n\n--how much time the update warning is shown (default 10)\nDetails.update_warning_timeout = 10;",
		["on_groupchange"] = "\n-- this code runs when the player enter or leave a group",
		["on_leavecombat"] = "\n-- this code runs when the player leave combat",
		["on_entercombat"] = "\n-- this code runs when the player enters in combat",
	},
	["show_totalhitdamage_on_overkill"] = false,
	["mobs_data_compiled"] = {
	},
	["global_plugin_database"] = {
	},
	["realm_sync"] = true,
	["createauraframe"] = {
		["y"] = 5.3405761718750e-05,
		["x"] = -1.525878906250e-05,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["item_level_pool"] = {
		["Player-4497-0054DE38"] = {
			["name"] = "全弹发射",
			["time"] = 1575732969,
			["ilvl"] = 0,
		},
		["Player-4497-00A03063"] = {
			["name"] = "夏宇",
			["time"] = 1575721737,
			["ilvl"] = 63.875,
		},
		["Player-4497-0079ED3F"] = {
			["name"] = "Stronger",
			["time"] = 1575722160,
			["ilvl"] = 0,
		},
		["Player-4497-00559D05"] = {
			["name"] = "Devops",
			["time"] = 1575732998,
			["ilvl"] = 0,
		},
		["Player-4497-00619488"] = {
			["name"] = "Fuse",
			["time"] = 1575732998,
			["ilvl"] = 0,
		},
		["Player-4497-005667E9"] = {
			["name"] = "腊肉汤",
			["time"] = 1575732472,
			["ilvl"] = 0,
		},
		["Player-4497-013E99C7"] = {
			["name"] = "Wangsir",
			["time"] = 1575766816,
			["ilvl"] = 0,
		},
		["Player-4497-009703B7"] = {
			["name"] = "舍丶予",
			["time"] = 1575722065,
			["ilvl"] = 0,
		},
		["Player-4497-00C80488"] = {
			["name"] = "席子",
			["time"] = 1575722126,
			["ilvl"] = 0,
		},
		["Player-4497-010E2639"] = {
			["name"] = "无情刷怪机",
			["time"] = 1575732144,
			["ilvl"] = 0,
		},
	},
	["update_warning_timeout"] = 10,
	["savedCustomSpells"] = {
		{
			3, -- [1]
			"环境伤害 (高处坠落)", -- [2]
			"Interface\\ICONS\\Spell_Magic_FeatherFall", -- [3]
		}, -- [1]
		{
			1, -- [1]
			"近战", -- [2]
			"Interface\\ICONS\\INV_Sword_04", -- [3]
		}, -- [2]
		{
			4, -- [1]
			"环境伤害 (溺水)", -- [2]
			"Interface\\ICONS\\Ability_Suffocate", -- [3]
		}, -- [3]
		{
			5, -- [1]
			"环境伤害 (疲劳)", -- [2]
			"Interface\\ICONS\\Spell_Arcane_MindMastery", -- [3]
		}, -- [4]
		{
			7, -- [1]
			"环境伤害 (岩浆)", -- [2]
			"Interface\\ICONS\\Ability_Rhyolith_Volcano", -- [3]
		}, -- [5]
	},
	["latest_news_saw"] = "",
	["mythic_plus"] = {
		["make_overall_boss_only"] = false,
		["mythicrun_chart_frame"] = {
		},
		["merge_boss_trash"] = true,
		["delay_to_show_graphic"] = 5,
		["always_in_combat"] = false,
		["make_overall_when_done"] = true,
		["delete_trash_after_merge"] = true,
		["show_damage_graphic"] = true,
		["mythicrun_chart_frame_ready"] = {
		},
		["boss_dedicated_segment"] = true,
		["mythicrun_chart_frame_minimized"] = {
		},
		["last_mythicrun_chart"] = {
		},
	},
	["raid_data"] = {
		["mythic_raid_data"] = {
			[0] = {
				["longest"] = 396,
				["kills"] = 0,
				["try_history"] = {
				},
				["wipes"] = 6,
				["best_try"] = 1,
			},
		},
	},
	["switchSaved"] = {
		["slots"] = 24,
		["table"] = {
			{
				["atributo"] = 1,
				["sub_atributo"] = 1,
			}, -- [1]
			{
				["atributo"] = 2,
				["sub_atributo"] = 1,
			}, -- [2]
			{
				["atributo"] = 1,
				["sub_atributo"] = 6,
			}, -- [3]
			{
				["atributo"] = 4,
				["sub_atributo"] = 5,
			}, -- [4]
			{
			}, -- [5]
			{
			}, -- [6]
			{
			}, -- [7]
			{
			}, -- [8]
			{
			}, -- [9]
			{
			}, -- [10]
			{
			}, -- [11]
			{
			}, -- [12]
			{
			}, -- [13]
			{
			}, -- [14]
			{
			}, -- [15]
			{
			}, -- [16]
			{
			}, -- [17]
			{
			}, -- [18]
			{
			}, -- [19]
			{
			}, -- [20]
			{
			}, -- [21]
			{
			}, -- [22]
			{
			}, -- [23]
			{
			}, -- [24]
		},
	},
	["always_use_profile_name"] = "",
	["savedStyles"] = {
	},
	["always_use_profile_exception"] = {
	},
	["details_auras"] = {
	},
	["tutorial"] = {
		["bookmark_tutorial"] = false,
		["main_help_button"] = 157,
		["ATTRIBUTE_SELECT_TUTORIAL1"] = true,
		["logons"] = 157,
		["DETAILS_INFO_TUTORIAL2"] = 6,
		["DISABLE_ONDEATH_PANEL"] = true,
		["STREAMER_PLUGIN_FIRSTRUN"] = true,
		["FULL_DELETE_WINDOW"] = true,
		["WINDOW_GROUP_MAKING1"] = true,
		["DETAILS_INFO_TUTORIAL1"] = true,
		["alert_frames"] = {
			false, -- [1]
			false, -- [2]
			false, -- [3]
			false, -- [4]
			false, -- [5]
			false, -- [6]
		},
		["OVERALLDATA_WARNING1"] = 60,
		["unlock_button"] = 4,
		["version_announce"] = 0,
		["OPTIONS_PANEL_OPENED"] = true,
		["WINDOW_LOCK_UNLOCK1"] = true,
		["MIN_COMBAT_TIME"] = true,
		["ctrl_click_close_tutorial"] = false,
	},
	["savedTimeCaptures"] = {
	},
	["plugin_window_pos"] = {
		["y"] = -5.3405761718750e-05,
		["x"] = 0.0001983642578125,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["custom"] = {
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示你的团队中谁在战斗时使用了药水.",
			["tooltip"] = "			--init:\n			local player, combat, instance = ...\n\n			--get the debuff container for potion of focus\n			local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n			if (debuff_uptime_container) then\n			    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n			    if (focus_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_FOCUS_POTION_ID)\n				GameCooltip:AddLine (name, 1) --> can use only 1 focus potion (can't be pre-potion)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n\n			--get the buff container for all the others potions\n			local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n			if (buff_uptime_container) then\n			    --potion of the jade serpent\n			    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n			    if (jade_serpent_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_INT_POTION_ID)\n				GameCooltip:AddLine (name, jade_serpent_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of mogu power\n			    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n			    if (mogu_power_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STR_POTION_ID)\n				GameCooltip:AddLine (name, mogu_power_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --mana potion\n			    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n			    if (mana_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_MANA_POTION_ID)\n				GameCooltip:AddLine (name, mana_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --prolongued power\n			    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n			    if (prolongued_power) then\n				local name, _, icon = GetSpellInfo (DETAILS_AGI_POTION_ID)\n				GameCooltip:AddLine (name, prolongued_power.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of the mountains\n			    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n			    if (mountains_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STAMINA_POTION_ID)\n				GameCooltip:AddLine (name, mountains_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n		",
			["attribute"] = false,
			["name"] = "有使用药水",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local misc_container = combat:GetActorList ( DETAILS_ATTRIBUTE_MISC )\n\n				--do the loop:\n				for _, player in ipairs ( misc_container ) do \n				    \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					\n					local found_potion = false\n					\n					--get the spell debuff uptime container\n					local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n					if (debuff_uptime_container) then\n					    --potion of focus (can't use as pre-potion, so, its amount is always 1\n					    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n\n					    if (focus_potion) then\n						total = total + 1\n						found_potion = true\n						if (top < 1) then\n						    top = 1\n						end\n						--add amount to the player \n						instance_container:AddValue (player, 1)\n					    end\n					end\n					\n					--get the spell buff uptime container\n					local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n					if (buff_uptime_container) then\n					    \n					    --potion of the jade serpent\n					    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n					    if (jade_serpent_potion) then\n						local used = jade_serpent_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of mogu power\n					    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n					    if (mogu_power_potion) then\n						local used = mogu_power_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --mana potion\n					    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n					    if (mana_potion) then\n						local used = mana_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of prolongued power\n					    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n					    if (prolongued_power) then\n						local used = prolongued_power.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of the mountains\n					    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n					    if (mountains_potion) then\n						local used = mountains_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					end\n					\n					if (found_potion) then\n					    amount = amount + 1\n					end    \n				    end\n				end\n\n				--return:\n				return total, top, amount\n				",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\INV_Potion_03",
			["script_version"] = 5,
		}, -- [1]
		{
			["source"] = false,
			["desc"] = "显示你的队伍中谁使用过治疗药水或者治疗石",
			["author"] = "Details! Team",
			["percent_script"] = false,
			["total_script"] = false,
			["attribute"] = false,
			["tooltip"] = "			--get the parameters passed\n			local actor, combat, instance = ...\n			\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GameCooltip = GameCooltip\n			local R, G, B, A = 0, 0, 0, 0.75\n			\n			local hs = actor:GetSpell (6262)\n			if (hs) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(6262)),  _detalhes:ToK(hs.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (6262)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_HEALTH_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_HEALTH_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_HEALTH_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_REJU_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_REJU_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_REJU_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n\n			--Cooltip code\n			",
			["name"] = "治疗药水&治疗石",
			["script"] = "			--get the parameters passed\n			local combat, instance_container, instance = ...\n			--declade the values to return\n			local total, top, amount = 0, 0, 0\n			\n			--do the loop\n			local AllHealCharacters = combat:GetActorList (DETAILS_ATTRIBUTE_HEAL)\n			for index, character in ipairs (AllHealCharacters) do\n				local AllSpells = character:GetSpellList()\n				local found = false\n				for spellid, spell in pairs (AllSpells) do\n					if (DETAILS_HEALTH_POTION_LIST [spellid]) then\n						instance_container:AddValue (character, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						found = true\n					end\n				end\n			\n				if (found) then\n					amount = amount + 1\n				end\n			end\n			--loop end\n			--return the values\n			return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\INV_Stone_04",
			["script_version"] = 15,
		}, -- [2]
		{
			["source"] = false,
			["tooltip"] = "				\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成伤害的时间",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "活跃伤害时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, amount = 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Red",
			["script_version"] = 2,
		}, -- [3]
		{
			["source"] = false,
			["tooltip"] = "				\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成治疗的时间.",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "活跃治疗时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_HEAL )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Green",
			["script_version"] = 2,
		}, -- [4]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["desc"] = "Show the crowd control amount for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n					if (character.cc_done and character:IsPlayer()) then\n						local cc_done = floor (character.cc_done)\n						instance_container:AddValue (character, cc_done)\n						total = total + cc_done\n						if (cc_done > top) then\n							top = cc_done\n						end\n						amount = amount + 1\n					end\n				end\n\n				return total, top, amount\n			",
			["name"] = "造成群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local spells = {}\n				for spellid, spell in pairs (actor.cc_done_spells._ActorTable) do\n				    tinsert (spells, {spellid, spell.counter})\n				end\n\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				local targets = {}\n				for playername, amount in pairs (actor.cc_done_targets) do\n				    tinsert (targets, {playername, amount})\n				end\n\n				table.sort (targets, _detalhes.Sort2)\n\n				_detalhes:AddTooltipSpellHeaderText (\"Targets\", \"yellow\", #targets)\n				local class, _, _, _, _, r, g, b = _detalhes:GetClass (actor.nome)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, target in ipairs (targets) do\n				    GameCooltip:AddLine (target[1], target [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (target [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				    --\n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Frost_FreezingBreath",
			["script_version"] = 11,
		}, -- [5]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["desc"] = "Show the amount of crowd control received for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amt = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n				DETAILS_CUSTOM_CC_RECEIVED_CACHE = DETAILS_CUSTOM_CC_RECEIVED_CACHE or {}\n				wipe (DETAILS_CUSTOM_CC_RECEIVED_CACHE)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					\n					for player_name, amount in pairs (character.cc_done_targets) do\n					    local target = combat (1, player_name) or combat (2, player_name)\n					    if (target and target:IsPlayer()) then\n						instance_container:AddValue (target, amount)\n						total = total + amount\n						if (amount > top) then\n						    top = amount\n						end\n						if (not DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name]) then\n						    DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name] = true\n						    amt = amt + 1\n						end\n					    end\n					end\n					\n				    end\n				end\n\n				return total, top, amt\n			",
			["name"] = "受到群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local name = actor:name()\n				local spells, from = {}, {}\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					local on_actor = character.cc_done_targets [name]\n					if (on_actor) then\n					    tinsert (from, {character:name(), on_actor})\n					    \n					    for spellid, spell in pairs (character.cc_done_spells._ActorTable) do\n						\n						local spell_on_actor = spell.targets [name]\n						if (spell_on_actor) then\n						    local has_spell\n						    for index, spell_table in ipairs (spells) do\n							if (spell_table [1] == spellid) then\n							    spell_table [2] = spell_table [2] + spell_on_actor\n							    has_spell = true\n							end\n						    end\n						    if (not has_spell) then\n							tinsert (spells, {spellid, spell_on_actor}) \n						    end\n						end\n						\n					    end            \n					end\n				    end\n				end\n\n				table.sort (from, _detalhes.Sort2)\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)    \n				end\n\n				_detalhes:AddTooltipSpellHeaderText (\"From\", \"yellow\", #from)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, t in ipairs (from) do\n				    GameCooltip:AddLine (t[1], t[2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (t [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end     \n				    \n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Frost_ChainsOfIce",
			["script_version"] = 3,
		}, -- [6]
		{
			["source"] = false,
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				local dps = _detalhes:ToK (floor (value) / combat:GetCombatTime())\n				local percent = string.format (\"%.1f\", value/total*100)\n				return dps .. \", \" .. percent\n			",
			["desc"] = "在统计中显示你的技能.",
			["tooltip"] = "				--config:\n				--Background RBG and Alpha:\n				local R, G, B, A = 0, 0, 0, 0.75\n				local R, G, B, A = 0.1960, 0.1960, 0.1960, 0.8697\n				\n				--get the parameters passed\n				local spell, combat, instance = ...\n				\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GC = GameCooltip\n				GC:SetOption (\"YSpacingMod\", 2)\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				\n				if (spell.n_dmg) then\n					\n					local spellschool, schooltext = spell.spellschool, \"\"\n					if (spellschool) then\n						local t = _detalhes.spells_school [spellschool]\n						if (t and t.name) then\n							schooltext = t.formated\n						end\n					end\n					\n					local total_hits = spell.counter\n					local combat_time = instance.showing:GetCombatTime()\n					\n					local debuff_uptime_total, cast_string = \"\", \"\"\n					local misc_actor = instance.showing (4, _detalhes.playername)\n					if (misc_actor) then\n						local debuff_uptime = misc_actor.debuff_uptime_spells and misc_actor.debuff_uptime_spells._ActorTable [spell.id] and misc_actor.debuff_uptime_spells._ActorTable [spell.id].uptime\n						if (debuff_uptime) then\n							debuff_uptime_total = floor (debuff_uptime / instance.showing:GetCombatTime() * 100)\n						end\n						\n						local spell_cast = misc_actor.spell_cast and misc_actor.spell_cast [spell.id]\n						\n						if (not spell_cast and misc_actor.spell_cast) then\n							local spellname = GetSpellInfo (spell.id)\n							for casted_spellid, amount in pairs (misc_actor.spell_cast) do\n								local casted_spellname = GetSpellInfo (casted_spellid)\n								if (casted_spellname == spellname) then\n									spell_cast = amount .. \" (|cFFFFFF00?|r)\"\n								end\n							end\n						end\n						if (not spell_cast) then\n							spell_cast = \"(|cFFFFFF00?|r)\"\n						end\n						cast_string = cast_string .. spell_cast\n					end\n					\n					--Cooltip code\n					GC:AddLine (\"Casts:\", cast_string or \"?\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					if (debuff_uptime_total ~= \"\") then\n						GC:AddLine (\"Uptime:\", (debuff_uptime_total or \"?\") .. \"%\")\n						GC:AddStatusBar (100, 1, R, G, B, A)\n						GC:AddIcon (\"\", 1, 1, 1, 16)\n					end\n					\n					GC:AddLine (\"Hits:\", spell.counter)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					local average = spell.total / total_hits\n					GC:AddLine (\"Average:\", _detalhes:ToK (average))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"E-Dps:\", _detalhes:ToK (spell.total / combat_time))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"School:\", schooltext)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					local n_average = spell.n_dmg / spell.n_amt\n					local T = (combat_time*spell.n_dmg)/spell.total\n					local P = average/n_average*100\n					T = P*T/100\n					\n					GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_dmg / T ))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					if (spell.c_amt > 0) then\n						local c_average = spell.c_dmg/spell.c_amt\n						local T = (combat_time*spell.c_dmg)/spell.total\n						local P = average/c_average*100\n						T = P*T/100\n						local crit_dps = spell.c_dmg / T\n						\n						GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n					else\n						GC:AddLine (\"Average / E-Dps: \",  \"0 / 0\")    \n					end\n					\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					\n					GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n				elseif (spell.n_curado) then\n					\n					local spellschool, schooltext = spell.spellschool, \"\"\n					if (spellschool) then\n						local t = _detalhes.spells_school [spellschool]\n						if (t and t.name) then\n							schooltext = t.formated\n						end\n					end\n					\n					local total_hits = spell.counter\n					local combat_time = instance.showing:GetCombatTime()\n					\n					--Cooltip code\n					GC:AddLine (\"Hits:\", spell.counter)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					local average = spell.total / total_hits\n					GC:AddLine (\"Average:\", _detalhes:ToK (average))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"E-Hps:\", _detalhes:ToK (spell.total / combat_time))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"School:\", schooltext)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					local n_average = spell.n_curado / spell.n_amt\n					local T = (combat_time*spell.n_curado)/spell.total\n					local P = average/n_average*100\n					T = P*T/100\n					\n					GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_curado / T ))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					if (spell.c_amt > 0) then\n						local c_average = spell.c_curado/spell.c_amt\n						local T = (combat_time*spell.c_curado)/spell.total\n						local P = average/c_average*100\n						T = P*T/100\n						local crit_dps = spell.c_curado / T\n						\n						GC:AddLine (\"Average / E-Hps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n					else\n						GC:AddLine (\"Average / E-Hps: \",  \"0 / 0\")    \n					end\n					\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n				end\n\n			",
			["attribute"] = false,
			["name"] = "我的技能",
			["script"] = "				--get the parameters passed\n				local combat, instance_container, instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				local player\n				local pet_attribute\n				\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				local spec = DetailsFramework.GetSpecialization()\n				role = spec and DetailsFramework.GetSpecializationRole (spec) or role\n\n				if (role == \"DAMAGER\") then\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				elseif (role == \"HEALER\") then    \n					player = combat (DETAILS_ATTRIBUTE_HEAL, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_HEAL\n				else\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				end\n\n				--do the loop\n\n				if (player) then\n					local spells = player:GetSpellList()\n					for spellid, spell in pairs (spells) do\n						instance_container:AddValue (spell, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						amount = amount + 1\n					end\n				    \n					for _, PetName in ipairs (player.pets) do\n						local pet = combat (pet_attribute, PetName)\n						if (pet) then\n							for spellid, spell in pairs (pet:GetSpellList()) do\n								instance_container:AddValue (spell, spell.total, nil, \" (\" .. PetName:gsub ((\" <.*\"), \"\") .. \")\")\n								total = total + spell.total\n								if (top < spell.total) then\n									top = spell.total\n								end\n								amount = amount + 1\n							end\n						end\n					end\n				end\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\CHATFRAME\\UI-ChatIcon-Battlenet",
			["script_version"] = 8,
		}, -- [7]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对标记骷髅的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [128]\n				if (DamageOnStar) then\n				    --RAID_TARGET_8 is the built-in localized word for 'Skull'.\n				    GameCooltip:AddLine (RAID_TARGET_8 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_8\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "对骷髅标记目标造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n				\n				--raid target flags: \n				-- 128: skull \n				-- 64: cross\n				-- 32: square\n				-- 16: moon\n				-- 8: triangle\n				-- 4: diamond\n				-- 2: circle\n				-- 1: star\n				\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					if (actor.raid_targets [128]) then\n					    CustomContainer:AddValue (actor, actor.raid_targets [128])\n					end        \n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_8",
			["script_version"] = 4,
		}, -- [8]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对其它所有标记的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object\n				local GameCooltip = GameCooltip\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [1]\n				if (DamageOnStar) then\n				    GameCooltip:AddLine (RAID_TARGET_1 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_1\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCircle = RaidTargets [2]\n				if (DamageOnCircle) then\n				    GameCooltip:AddLine (RAID_TARGET_2 .. \":\", format_func (_, DamageOnCircle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_2\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnDiamond = RaidTargets [4]\n				if (DamageOnDiamond) then\n				    GameCooltip:AddLine (RAID_TARGET_3 .. \":\", format_func (_, DamageOnDiamond))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_3\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnTriangle = RaidTargets [8]\n				if (DamageOnTriangle) then\n				    GameCooltip:AddLine (RAID_TARGET_4 .. \":\", format_func (_, DamageOnTriangle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_4\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnMoon = RaidTargets [16]\n				if (DamageOnMoon) then\n				    GameCooltip:AddLine (RAID_TARGET_5 .. \":\", format_func (_, DamageOnMoon))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_5\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnSquare = RaidTargets [32]\n				if (DamageOnSquare) then\n				    GameCooltip:AddLine (RAID_TARGET_6 .. \":\", format_func (_, DamageOnSquare))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_6\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCross = RaidTargets [64]\n				if (DamageOnCross) then\n				    GameCooltip:AddLine (RAID_TARGET_7 .. \":\", format_func (_, DamageOnCross))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_7\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "对其它标记目标造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					local total = (actor.raid_targets [1] or 0) --star\n					total = total + (actor.raid_targets [2] or 0) --circle\n					total = total + (actor.raid_targets [4] or 0) --diamond\n					total = total + (actor.raid_targets [8] or 0) --tiangle\n					total = total + (actor.raid_targets [16] or 0) --moon\n					total = total + (actor.raid_targets [32] or 0) --square\n					total = total + (actor.raid_targets [64] or 0) --cross\n					\n					if (total > 0) then\n					    CustomContainer:AddValue (actor, total)\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_5",
			["script_version"] = 4,
		}, -- [9]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n\n				--get the time of overall combat\n				local OverallCombatTime = Details:GetCombat (-1):GetCombatTime()\n\n				--get the time of current combat if the player is in combat\n				if (Details.in_combat) then\n				    local CurrentCombatTime = Details:GetCombat (0):GetCombatTime()\n				    OverallCombatTime = OverallCombatTime + CurrentCombatTime\n				end\n\n				--build the string\n				local ToK = Details:GetCurrentToKFunction()\n				local s = ToK (_, value / OverallCombatTime)\n				\n				if (instance.row_info.textR_show_data[3]) then\n				    s = ToK (_, value) .. \" (\" .. s .. \", \"\n				else\n				    s = ToK (_, value) .. \" (\" .. s\n				end\n\n				return s\n			",
			["desc"] = "Show overall damage done on the fly.",
			["attribute"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n\n				if (not OverallCombat.GetActorList or not CurrentCombat.GetActorList) then\n				    return 0, 0, 0\n				end\n\n				--get the damage actor container for overall\n				local damage_container_overall = OverallCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				--get the damage actor container for current\n				local damage_container_current = CurrentCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n\n				--do the loop:\n				for _, player in ipairs ( damage_container_overall ) do \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					instance_container:AddValue (player, player.total)\n				    end\n				end\n\n				if (Details.in_combat) then\n				    for _, player in ipairs ( damage_container_current ) do \n					--only player in group\n					if (player:IsGroupPlayer()) then\n					    instance_container:AddValue (player, player.total)        \n					end\n				    end\n				end\n\n				total, top =  instance_container:GetTotalAndHighestValue()\n				amount =  instance_container:GetNumActors()\n\n				--return:\n				return total, top, amount\n			",
			["name"] = "动态总体伤害",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n				\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip2\n				\n				--Cooltip code\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n				\n				local AllSpells = {}\n				\n				--overall\n				local player = OverallCombat [1]:GetActor (actor.nome)\n				local playerSpells = player:GetSpellList()\n				for spellID, spellTable in pairs (playerSpells) do\n					local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n					AllSpells [spellName] = spellTable.total\n				end\n				\n				--current\n				local player = CurrentCombat [1]:GetActor (actor.nome)\n				if (player) then\n					local playerSpells = player:GetSpellList()\n					for spellID, spellTable in pairs (playerSpells) do\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						AllSpells [spellName] = (AllSpells [spellName] or 0) + (spellTable.total or 0)\n					end\n				end\n				\n				local sortedList = {}\n				for spellID, total in pairs (AllSpells) do\n					tinsert (sortedList, {spellID, total})\n				end\n				table.sort (sortedList, Details.Sort2)\n				\n				local format_func = Details:GetCurrentToKFunction()\n				\n				--build the tooltip\n				for i, t in ipairs (sortedList) do\n					local spellID, total = unpack (t)\n					if (total > 1) then\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						\n						GameCooltip:AddLine (spellName, format_func (_, total))\n						Details:AddTooltipBackgroundStatusbar()\n						GameCooltip:AddIcon (spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n					end\n				end\n\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\Spell-Reset",
			["script_version"] = 5,
		}, -- [10]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Damage done to shields",
			["tooltip"] = "				--get the parameters passed\n				local actor, Combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				--get the actor total damage absorbed\n				local totalAbsorb = actor.totalabsorbed\n				local format_func = Details:GetCurrentToKFunction()\n\n				--get the damage absorbed by all the actor pets\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n				    end\n				end\n\n				GameCooltip:AddLine (actor:Name(), format_func (_, actor.totalabsorbed))\n				Details:AddTooltipBackgroundStatusbar()\n\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n					\n					GameCooltip:AddLine (petName, format_func (_, pet.totalabsorbed))\n					Details:AddTooltipBackgroundStatusbar()        \n					\n				    end\n				end\n			",
			["attribute"] = false,
			["name"] = "对护盾造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for index, actor in ipairs (Combat:GetActorList(1)) do\n				    if (actor:IsPlayer()) then\n					\n					--get the actor total damage absorbed\n					local totalAbsorb = actor.totalabsorbed\n					\n					--get the damage absorbed by all the actor pets\n					for petIndex, petName in ipairs (actor.pets) do\n					    local pet = Combat :GetActor (1, petName)\n					    if (pet) then\n						totalAbsorb = totalAbsorb + pet.totalabsorbed\n					    end\n					end\n					\n					--add the value to the actor on the custom container\n					CustomContainer:AddValue (actor, totalAbsorb)        \n					\n				    end\n				end\n				--loop end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Holy_PowerWordShield",
			["script_version"] = 2,
		}, -- [11]
	},
	["performance_profiles"] = {
		["Dungeon"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["RaidFinder"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground40"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Mythic"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Arena"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid30"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
	},
	["exit_log"] = {
		"1 - Closing Janela Info.", -- [1]
		"2 - Clearing user place from instances.", -- [2]
		"4 - Reversing switches.", -- [3]
		"6 - Saving Config.", -- [4]
		"7 - Saving Profiles.", -- [5]
		"8 - Saving nicktag cache.", -- [6]
	},
	["report_where"] = "GUILD",
	["lastUpdateWarning"] = 1575717262,
	["data_sync"] = false,
}
